[
  {
    "id": "c705fc3c-3d0f-4bde-8f86-6c203b5a4b57",
    "title": "Professional costing framework should be implemented to determine cost price of electricity: Response",
    "date": "2025-06-20 18:31:00",
    "body": null,
    "link": "https://www.ft.lk/columns/Professional-costing-framework-should-be-implemented-to-determine-cost-price-of-electricity--Response/4-777977",
    "source": "ft_lk",
    "status": "new"
  },
  {
    "id": "ee754e97-8afd-4c21-983b-d52415a3cbc1",
    "title": "Flights From Hyd Cancelled Due To Strict DGCA Checks",
    "date": "2025-06-20 18:30:26",
    "body": "According to DGCA data, 66 flights operated by the Dreamliner aircraft have been scrubbed since the crash.",
    "link": "https://www.deccanchronicle.com/southern-states/telangana/flights-from-hyd-cancelled-due-to-strict-dgca-checks-1886540",
    "source": "andhrabhoomi",
    "status": "new"
  },
  {
    "id": "440bf091-6283-41a9-9922-58b9fd74f5cd",
    "title": "Avelo Airlines Explores New Expansion to McKinney National Airport as It Undergoes Major Upgrades",
    "date": "2025-06-20 18:30:07",
    "body": "**Title: Avelo Airlines Plans New Routes to Upgraded McKinney National Airport**\n\nAvelo Airlines, known for its affordable flights, is considering expanding to McKinney National Airport, north of Dallas. This potential move comes as the airport undergoes significant upgrades, enhancing its facilities and capacity. If the expansion occurs, it could offer travelers more budget-friendly options in the Dallas area.",
    "link": "https://www.travelandtourworld.com/news/article/avelo-airlines-explores-new-expansion-to-mckinney-national-airport-as-it-undergoes-major-upgrades/",
    "source": "travelandtourworld",
    "status": "posted"
  },
  {
    "id": "d2e59a7d-a305-4b15-8714-1959fa13c300",
    "title": "Late Minister Lakshman Kadirgamar story on surviving Swissair Athens plane crash in 1979",
    "date": "2025-06-20 18:30:00",
    "body": null,
    "link": "https://www.ft.lk/opinion/Late-Minister-Lakshman-Kadirgamar-story-on-surviving-Swissair-Athens-plane-crash-in-1979/14-777985",
    "source": "ft_lk",
    "status": "new"
  },
  {
    "id": "0fe408b7-991b-4c25-8a46-f2a7d7756298",
    "title": "As routes shift, flight fares go on steep ascent",
    "date": "2025-06-20 18:30:00",
    "body": "Airfares from India to international destinations have surged recently, impacting summer holiday travel plans. The Israel-Iran conflict causing airspace closures, fuel price fluctuations, and reduced seat capacity are contributing factors. Europe, particularly France, Germany, and the UK, are experiencing the most significant fare increases, with potential for further rises if disruptions persist.",
    "link": "https://economictimes.indiatimes.com/industry/transportation/airlines-/-aviation/as-routes-shift-flight-fares-go-on-steep-ascent/articleshow/121981803.cms",
    "source": "economictimes_indiatimes",
    "status": "new"
  },
  {
    "id": "811691dd-0b7f-42b8-99d2-cc366c3b089e",
    "title": "Honeywell, ITT, Eaton See Bright Outlook As BofA Securities Cites Military Spending, Aftermarket Growth",
    "date": "2025-06-20 18:27:51",
    "body": "BofA Securities analyst Andrew Obin hosted investor meetings at the Paris Air Show with Honeywell International (NASDAQ:HON), Eaton Corp (NYSE:ETN), Parker-Hannifin Corp (NYSE:PH), Ametek Inc (NYSE:AME), and ITT Inc (NYSE:ITT).All the companies the analyst met with were bullish on increased defense momentum, particularly in Europe.He said companies were broadly constructive on the cycle from both an original equipment ramp standpoint and sustained aftermarket momentum, with many citing a boost from retrofits, modifications, and upgrades (RMU).Also Read: Honeywell, Near Earth Autonomy Test Pilot-Free Helicopter For Faster, Safer Marine SupplyObin said that conversations focused on sources of outgrowth and margin expansion (on margin, particularly for Parker-Hannifin and Eaton).According to the analyst, original equipment pricing is clearly a lever for certain companies, including Eaton and ITT.Obin maintained Buy ratings on Honeywell, Parker-Hannifin, Eaton Corp, Ametek and ITT.Honeywell: Obin noted that the industry outlook supports Honeywell’s medium-term target for mid-to-high single-digit aerospace industry growth. The analyst noted that the aftermarket is the key area to enable outgrowth relative to the market. The company is sticking with its framework on margins (e.g., long-term 29% aerospace margins) but being conservative near-term. Investors are prioritizing growth over margins, as per Obin.Eaton Corp.: The analyst’s meeting with Eaton focused on the company’s margin expansion targets, accelerating military spending and sources of commercial outgrowth. Volume ...Full story available on Benzinga.com",
    "link": "https://www.benzinga.com/analyst-stock-ratings/analyst-color/25/06/46035394/honeywell-itt-eaton-see-bright-outlook-as-bofa-securities-cites-military-spen",
    "source": "benzinga",
    "status": "new"
  },
  {
    "id": "30389bda-7b90-4e8e-b470-065d6169ccea",
    "title": "33 Pilgrims Leave For Kailash Yatra",
    "date": "2025-06-20 18:26:16",
    "body": "Tourism and civil aviation department additional chief secretary C.S. Rao welcomed the pilgrims on behalf of the state government and the people of Sikkim.",
    "link": "https://www.deccanchronicle.com/nation/33-pilgrims-leave-for-kailash-yatra-1886538",
    "source": "andhrabhoomi",
    "status": "new"
  },
  {
    "id": "2bee76e7-3b39-42aa-82b5-1e8522333e76",
    "title": "Breach of contract: Court fixes Oct. 22 to hear suit against Virgin Atlantic Airways",
    "date": "2025-06-20 18:20:54",
    "body": "By Lukman Olabiyi The Federal High Court in Lagos will, on October 22, hear a lawsuit filed by security expert Alhaji Ahmed Rabiu against Virgin Atlantic Airways over alleged breach of contract and the loss of his luggage. The hearing, initially set for Friday, was adjourned because the airline failed to file its defence within [...]The post Breach of contract: Court fixes Oct. 22 to hear suit against Virgin Atlantic Airways appeared first on The Sun Nigeria.",
    "link": "https://thesun.ng/breach-of-contract-court-fixes-oct-22-to-hear-suit-against-virgin-atlantic-airways/",
    "source": "sunnewsonline",
    "status": "new"
  },
  {
    "id": "5ffb81ae-44d2-4085-8747-4475e3879bcd",
    "title": "Israel evacuees rely on Florida — or private groups led by vets, ex-spies, or ex-diplomats — to get home",
    "date": "2025-06-20 18:19:53",
    "body": "As ballistic missiles from Iran struck Israel, U.S. visitors used their own initiatives or turned to quickly assembled rescue efforts by the state of Florida and an array of private organizations.",
    "link": "https://www.sun-sentinel.com/2025/06/20/israel-evacuees-rely-on-florida-or-private-groups-led-by-vets-ex-spies-or-ex-diplomats-to-get-home/",
    "source": "sun_sentinel",
    "status": "new"
  },
  {
    "id": "3fc363f2-1fe1-4af6-bccd-97989e77c368",
    "title": "Israel evacuees rely on Florida — or private groups led by vets, ex-spies, or ex-diplomats — to get home",
    "date": "2025-06-20 18:19:53",
    "body": "As ballistic missiles from Iran struck Israel, U.S. visitors used their own initiatives or turned to quickly assembled rescue efforts by the state of Florida and an array of private organizations.",
    "link": "https://www.orlandosentinel.com/2025/06/20/israel-evacuees-rely-on-florida-or-private-groups-led-by-vets-ex-spies-or-ex-diplomats-to-get-home/",
    "source": "orlandosentinel",
    "status": "new"
  },
  {
    "id": "e547f070-f8dc-47a2-8acc-8481bb06995a",
    "title": "Tunisian air force inks first North African deal to procure dozen Bell 412 helicopters",
    "date": "2025-06-20 17:52:45",
    "body": "“The SUBARU Bell 412EPX has been gaining momentum as an international military platform, we’re thrilled to bring it to the Middle East and Africa region with the Tunisian Air Force,” Bell Texton’s Tim Evans said.",
    "link": "https://breakingdefense.com/2025/06/tunisian-air-force-inks-first-north-african-deal-to-procure-dozen-bell-412-helicopters/",
    "source": "breakingdefense",
    "status": "new"
  },
  {
    "id": "307867f4-1b02-4853-8b76-6b9b5f48bfcc",
    "title": "Watch heartbreaking video as body of 26-year-old flight attendant arrives her hometown for funeral",
    "date": "2025-06-20 17:49:43",
    "body": "The remains of 26-year-old crew member, Lamnunthem Singson, who was working with Air India before her demise has gotten to her hometown in Manipur.",
    "link": "https://www.legit.ng/people/1660656-community-members-grieve-body-26-year-air-india-flight-attendant-arrives-home-funeral/",
    "source": "legit",
    "status": "new"
  },
  {
    "id": "fc90f588-5873-44d0-a7cd-ffd8ae16eed1",
    "title": "Indian Aviation Industry Forecasted to Face Heavy Losses in Crores in FY2026 Despite A Ten Percent Growth in Passenger Traffic, Says ICRA Report",
    "date": "2025-06-20 17:48:54",
    "body": "Despite a 10% increase in domestic air traffic, ICRA forecasts ₹25,000+ crore losses for Indian airlines in FY2026 due to high costs and financial headwindsThe post Indian Aviation Industry Forecasted to Face Heavy Losses in Crores in FY2026 Despite A Ten Percent Growth in Passenger Traffic, Says ICRA Report appeared first on Travel And Tour World.",
    "link": "https://www.travelandtourworld.com/news/article/indian-aviation-industry-forecasted-to-face-heavy-losses-in-crores-in-fy2026-despite-a-ten-percent-growth-in-passenger-traffic-says-icra-report/",
    "source": "travelandtourworld",
    "status": "new"
  },
  {
    "id": "29598006-e1f4-4f29-b3c4-8db9342c5b35",
    "title": "Gavilan alum takes flight in aerospace engineering",
    "date": "2025-06-20 17:48:38",
    "body": "**Title: From Gavilan College to NASA: Esthefani Montelon's Journey in Aerospace Engineering**\n\nEsthefani Montelon's adventure into aerospace began when she joined the Airframe and Powerplant program at Gavilan College in 2019. Drawn by the desire to work with her hands, Esthefani soon discovered her passion for aerospace engineering. Today, she is not only advancing her studies but also gaining experience through prestigious internships at NASA and leading aerospace manufacturer Pratt & Whitney. Esthefani's story is an inspiring example of where dedication and curiosity can take you—from a community college classroom to the forefront of aerospace innovation.",
    "link": "https://sanbenito.com/gavilan-alum-takes-flight-in-aerospace-engineering/",
    "source": "sanbenito",
    "status": "posted"
  },
  {
    "id": "102ec288-b985-47aa-a413-1b4460be54e4",
    "title": "Competition Bureau pushes for air travel changes as passengers face high costs and limited choice",
    "date": "2025-06-20 17:46:13",
    "body": null,
    "link": "https://www.cp24.com/news/canada/2025/06/20/competition-bureau-pushes-for-air-travel-changes-as-passengers-face-high-costs-and-limited-choice/",
    "source": "cp24",
    "status": "new"
  },
  {
    "id": "e17d43ae-f343-44f6-8ce9-3d6436b6f417",
    "title": "Summerlin near several recreational destination spots",
    "date": "2025-06-20 17:45:19",
    "body": "Situated adjacent Red Rock Canyon National Conservation Area, the master-planned community of Summerlin has long been a draw for homebuyers seeking immediate access to one of the most spectacular natural landscapes in Southern Nevada and a world-class hiking, rock-climbing and cycling destination.",
    "link": "https://www.reviewjournal.com/homes/advertising-features/summerlin-near-several-recreational-destination-spots-3387426/",
    "source": "reviewjournal",
    "status": "new"
  },
  {
    "id": "9a375084-857a-4de2-a993-393d6cdfdfeb",
    "title": "A’bad-Delhi AI 456 among eight cancelled Air India flights",
    "date": "2025-06-20 17:45:05",
    "body": null,
    "link": "https://timesofindia.indiatimes.com/city/ahmedabad/abad-delhi-ai-456-among-eight-cancelled-air-india-flights/articleshow/121980427.cms",
    "source": "toi",
    "status": "new"
  },
  {
    "id": "581fbc7b-84e0-443c-844b-f1a44528c612",
    "title": "Los Angeles Lakers NBA Team Being Sold in Staggering $10 Billion Deal",
    "date": "2025-06-20 17:44:09",
    "body": "The Los Angeles Lakers are rebounding into new leadership. In one of the biggest deals in sports, the owners of the Lakers—the Buss family—have agreed to sell majority ownership of the team to...",
    "link": "https://www.eonline.com/news/1418963/los-angels-lakers-nba-team-sold-in-s10-billion-deal",
    "source": "eonline",
    "status": "new"
  },
  {
    "id": "572346d4-c658-4aa6-8b43-c5f070574504",
    "title": "'Flying On A Dreamliner? I'm On': Ex Aviation Minister Praful Patel After Crash",
    "date": "2025-06-20 17:42:42",
    "body": "There is no cause for worry after the Air India crash in Ahmedabad and the country's regulatory framework is strong, former civil aviation minister Praful Patel has said.",
    "link": "https://www.ndtv.com/india-news/ahmedabad-crash-flying-on-a-dreamliner-im-on-ex-aviation-minister-praful-patel-after-air-india-crash-8719772",
    "source": "ndtv",
    "status": "new"
  },
  {
    "id": "39dbff50-8ad9-4f9f-8c82-6aeacbba0b1d",
    "title": "Sun TV: It Is Old Family Matter",
    "date": "2025-06-20 17:40:54",
    "body": "Sun TV Network dismissed allegations from DMK MP Dayanidhi Maran as a “purely personal” family dispute, after his legal notice accused chairman Kalanidhi Maran of a ₹5,926-crore share fraud dating back to 2003.",
    "link": "https://www.deccanchronicle.com/southern-states/tamil-nadu/sun-tv-it-is-old-family-matter-1886520",
    "source": "andhrabhoomi",
    "status": "new"
  },
  {
    "id": "20c8e7de-5e70-465e-b813-e14206a799f6",
    "title": "Health officials issue warnings as UK Northern Europe bake in first heat wave of 2025",
    "date": "2025-06-20 17:37:12",
    "body": "London, Jun 20 (AP) British and French authorities have issued health warnings related to hot weather this weekend as northern",
    "link": "https://www.theweek.in/wire-updates/international/2025/06/20/fgn70-eu-heat-wave.html",
    "source": "theweek_in",
    "status": "new"
  },
  {
    "id": "2c8396f5-dc7e-4f54-a492-05c39110b8fd",
    "title": "Russell Rebalance: 3 Stocks Ready to Move Higher",
    "date": "2025-06-20 17:37:00",
    "body": null,
    "link": "https://www.investing.com/analysis/russell-rebalance-3-stocks-ready-to-move-higher-200662544",
    "source": "investing_us",
    "status": "new"
  },
  {
    "id": "a39dc1b0-49a8-4414-86c8-3c96c6da6a8d",
    "title": "Govt committed to protecting intellectual property: Minister Pandey",
    "date": "2025-06-20 16:38:48",
    "body": "Kathmandu, June 20: Minister for Culture, Tourism and Civil Aviation, Badri Prasad Pandey, has reaffirmed the government...",
    "link": "https://risingnepaldaily.com/news/63882",
    "source": "risingnepaldaily",
    "status": "new"
  },
  {
    "id": "ed319ccd-9a86-4dc1-97cb-75ed84739797",
    "title": "‘Major Anomaly’ Behind Latest SpaceX Starship Explosion",
    "date": "2025-06-20 16:38:37",
    "body": "**Title: High-Pressure Tank Issue Causes SpaceX Starship Explosion**\n\nArticle: SpaceX's recent Starship rocket explosion was likely due to a high-pressure nitrogen tank failure, according to CEO Elon Musk.",
    "link": "https://www.wired.com/story/spacex-starship-explosion-major-anomaly/",
    "source": "wired",
    "status": "posted"
  },
  {
    "id": "e8cfd30f-aba4-4c6c-a791-c5948e48c261",
    "title": "Air Methods Partners with Mauna Loa Helicopters to Introduce Pilots to Air Medical Careers",
    "date": "2025-06-20 16:33:59",
    "body": "Grass is Greener initiative provides real-world training, opens doors for next generation of pilotsMauna Loa Helicopters to Introduce Pilots to Air Medical CareersPart of Air Methods' 'Grass Is Greener' InitiativeMauna Loa Pilots Participate in Air Methods' Pilot Training in DenverPart of Air Methods' 'Grass Is Greener' InitiativeGREENWOOD VILLAGE, CO, June 20, 2025 (GLOBE NEWSWIRE) -- Air Methods, the nation's leading air medical service provider, has partnered with Mauna Loa Helicopters to offer aspiring pilots a closer look at career opportunities in the helicopter emergency medical services (HEMS) industry. This partnership is part of Air Methods' new Grass is Greener initiative, which introduces newer pilots-and those currently flying in the tourism sector-to the unique mission and career potential of the air medical industry.The partnership launched last month with two Mauna Loa pilots participating in Air Methods' multi-day pilot training in Denver. The training featured classroom instruction, simulator sessions, and hands-on aircraft experience. Pilots also received education in key areas such as aeronautical decision-making, IFR and GPS navigation, and aircraft and equipment security.\"Our goal is to help bridge the gap between early-stage flight training and the highly specialized world of air medical services,” said Rob Hamilton, CEO of Air Methods. \"By partnering with respected flight schools like Mauna Loa Helicopters, we're opening doors for talented pilots to explore careers that combine aviation excellence with lifesaving impact.”Mauna Loa Helicopters, which currently has 32 flight instructors across its various campuses, plans to send a group of instructors to Air Methods' training program on a quarterly basis. This experience will provide pilots with real-world exposure to a national air medical provider, insights into industry standards and expectations, and valuable networking opportunities with experienced air medical professionals. For many instructors, it also represents a significant step forward in building a long-term career in professional aviation.\"Air Methods offers the kind of professional environment and mission-driven work that aligns with what many of our instructors aspire to,” said Benjamin Fouts, owner of Mauna Loa Helicopters, adding how he sees this partnership as a strategic move to better prepare his instructors for careers beyond flight training. \"We're excited to offer them access to this level of training, mentorship, and potential career pathways.”As the Grass is Greener initiative continues to grow, Air Methods remains committed to cultivating the next generation of air medical pilots by building strong relationships with flight schools across the country. ###About Mauna Loa HelicoptersMauna Loa Helicopters is a leading provider of helicopter and fixed-wing flight training, air tours, and utility services across the Hawaiian Islands. With bases throughout the islands and headquarters at Kona International Airport, the company delivers high-quality, FAA-approved training programs under Parts 141 and 61. We are proud to be an ACCSC-accredited institution and one of only two federally funded flight schools in the nation. Mauna Loa is also the only flight school in Hawaii approved by the Department of Education (DOE), setting us apart as a premier training provider in the region. In addition to training, Mauna Loa offers unforgettable aerial experiences for visitors and provides critical utility services, including external load operations, aerial survey, and agricultural support. The company operates a fleet of Robinson helicopters and fixed-wing aircraft. With a strong focus on safety, community engagement, and career development, Mauna Loa Helicopters continues to shape the future of aviation in Hawaii and beyond.About Air MethodsAir Methods is the leading air medical service, delivering lifesaving care to more than 100,000 people every year. With 45 years of experience, Air Methods is the preferred partner for hospitals and one of the largest community-based providers of air medical services. Air Methods Ascend is the company's clinical education program, allowing critical care nurses and paramedics best-in-class training opportunities using high-fidelity mannequins, virtual reality, and cadaver labs.AttachmentsMauna Loa Helicopters to Introduce Pilots to Air Medical CareersMauna Loa Pilots Participate in Air Methods' Pilot Training in DenverCONTACT: Denisse CoffmanAir Methods720-666-8499media@airmethods.com",
    "link": "https://www.manilatimes.net/2025/06/21/tmt-newswire/globenewswire/air-methods-partners-with-mauna-loa-helicopters-to-introduce-pilots-to-air-medical-careers/2137172",
    "source": "manilatimes",
    "status": "new"
  },
  {
    "id": "43ba1ffa-ad94-4bb8-819b-de46061f946c",
    "title": "UK Navy declines Air India’s hangar space offer to park grounded F-35B: Sources",
    "date": "2025-06-20 16:33:00",
    "body": "A British F-35B stealth fighter jet has been parked in Kerala for six days after an emergency landing due to a technical snag. Despite Air India’s offer, the Royal Navy declined hangar space, likely to protect sensitive technologies onboard.",
    "link": "https://www.news9live.com/world/uk-navy-declines-air-indias-hangar-space-offer-to-park-grounded-f-35b-sources-2870781",
    "source": "news9live",
    "status": "new"
  },
  {
    "id": "247c1acb-71fc-4791-838f-0f931c4a87d5",
    "title": "As instability prevails in West Asia, how will airlines navigate safely across the region?",
    "date": "2025-06-20 16:30:00",
    "body": "The region is a major global connectivity hub and home to several of the world’s largest international airlines.",
    "link": "https://scroll.in/article/1083628/as-instability-prevails-how-will-airlines-navigate-west-asia-safely",
    "source": "scroll",
    "status": "new"
  },
  {
    "id": "121c9d1d-91b7-4185-b97f-a764ecc8e68f",
    "title": "Ambitions In Madrid: Iberia’s Current And Potential Future North American Routes Explored",
    "date": "2025-06-20 16:29:09",
    "body": "In June, Iberia has ten routes to North America, including one itinerary to Mexico City, Mexico.",
    "link": "https://simpleflying.com/iberia-madrid-north-america-routes/",
    "source": "simpleflying",
    "status": "new"
  },
  {
    "id": "29d16673-9f1e-478d-849b-80b0f6ae01e8",
    "title": "Zhuhai Airport Marks Three Decades of Success as AAHK Strengthens Its Stake, Transforming Airport Efficiency and Fueling Passenger Growth in Mainland China",
    "date": "2025-06-20 16:28:17",
    "body": "Zhuhai Airport has reached a significant milestone, celebrating three decades of remarkable success, largely driven by its strategic partnership with the Airport Authority Hong Kong (AAHK).The post Zhuhai Airport Marks Three Decades of Success as AAHK Strengthens Its Stake, Transforming Airport Efficiency and Fueling Passenger Growth in Mainland China appeared first on Travel And Tour World.",
    "link": "https://www.travelandtourworld.com/news/article/zhuhai-airport-marks-three-decades-of-success-as-aahk-strengthens-its-stake-transforming-airport-efficiency-and-fueling-passenger-growth-in-mainland-china/",
    "source": "travelandtourworld",
    "status": "new"
  },
  {
    "id": "1f397cc0-543c-44b0-9351-77fc93025cf3",
    "title": "Iberia’s Visionary Six Billion Euros Flight Plan 2030 Set to Transform Spain’s Airline Fleet, Expand Global Reach, and Elevate Premium Travel Experiences",
    "date": "2025-06-20 16:26:36",
    "body": "Iberia, Spain's flagship airline, has unveiled its visionary Flight Plan 2030, committing an impressive six billion euros to reshape its future.The post Iberia’s Visionary Six Billion Euros Flight Plan 2030 Set to Transform Spain’s Airline Fleet, Expand Global Reach, and Elevate Premium Travel Experiences appeared first on Travel And Tour World.",
    "link": "https://www.travelandtourworld.com/news/article/iberias-visionary-six-billion-euros-flight-plan-2030-set-to-transform-spains-airline-fleet-expand-global-reach-and-elevate-premium-travel-experiences/",
    "source": "travelandtourworld",
    "status": "new"
  },
  {
    "id": "690dd40f-550b-49de-948f-01f6a2aa8840",
    "title": "Air India bookings plunge 20% after plane crash in Ahmedabad",
    "date": "2025-06-20 16:25:18",
    "body": "Air India's flight bookings have taken a major hit, plummeting by around 20% on domestic and international routes.",
    "link": "https://www.newsbytesapp.com/news/business/air-india-bookings-drop-20-after-plane-crash-sparks-concerns/story",
    "source": "newsbytesapp",
    "status": "new"
  },
  {
    "id": "5d4667b9-144e-4326-a8ce-a072717cf206",
    "title": "EHang, ANRA Technologies partner to accelerate global UAM deployment",
    "date": "2025-06-20 16:22:09",
    "body": "Announced during the 2025 Paris Air Show, the partnership aims to advance the integration of digital airspace infrastructure, particularly across Europe and Latin America.",
    "link": "https://news.metal.com/newscontent/103388100/ehang-anra-technologies-partner-to-accelerate-global-uam-deployment/",
    "source": "metal_news",
    "status": "new"
  },
  {
    "id": "75a687ac-315d-4b47-9b6c-33183836719c",
    "title": "Skyrocketing Israel-Iran Conflict To Unchanged US Repo Rate — The Week That Was",
    "date": "2025-06-20 15:54:26",
    "body": "Trump's uncertain remarks have heightened tensions in the ongoing Israel-Iran conflict.",
    "link": "https://www.ndtvprofit.com/business/skyrocketing-israel-iran-conflict-to-unchanged-us-repo-rate-the-week-that-was",
    "source": "bloombergquint",
    "status": "new"
  },
  {
    "id": "ca72da61-7725-43fc-ab73-281b95add8bd",
    "title": "India News | Punjab: AAP, Congress, SAD Target Omar Abdullah for Remarks on Water Sharing",
    "date": "2025-06-20 15:54:13",
    "body": "Get latest articles and stories on India at LatestLY. The ruling Aam Aadmi Party, Congress, and the Shiromani Akali Dal in Punjab on Friday targeted Jammu and Kashmir Chief Minister Omar Abdullah for his remarks that no permission will be given as of now for any proposal to build a canal to divert surplus water to other states.",
    "link": "https://www.latestly.com/agency-news/india-news-punjab-aap-congress-sad-target-omar-abdullah-for-remarks-on-water-sharing-6941697.html",
    "source": "latestly",
    "status": "new"
  },
  {
    "id": "e78da390-975e-4488-aa52-0c4f4ab7783e",
    "title": "Shock moment passenger threatens to CRASH Air India plane mid-flight in furious row just days after Ahmedabad disaster",
    "date": "2025-06-20 15:53:44",
    "body": null,
    "link": "https://www.the-sun.com/news/14525322/passenger-threatens-crash-air-india-plane/",
    "source": "thesun",
    "status": "new"
  },
  {
    "id": "35888ec1-9bde-4116-a026-aa4bbb205342",
    "title": "Shock moment passenger threatens to CRASH Air India plane mid-flight in furious row just days after Ahmedabad disaster",
    "date": "2025-06-20 15:53:44",
    "body": null,
    "link": "https://www.thesun.ie/news/15411449/passenger-threatens-crash-air-india-plane/",
    "source": "thesun_ie",
    "status": "new"
  },
  {
    "id": "0d1600a4-d808-40ce-a160-8497e0adfd8a",
    "title": "Shock moment passenger threatens to CRASH Air India plane mid-flight in furious row just days after Ahmedabad disaster",
    "date": "2025-06-20 15:53:44",
    "body": null,
    "link": "https://www.thescottishsun.co.uk/uncategorized/14969767/passenger-threatens-crash-air-india-plane/",
    "source": "thescottishsun",
    "status": "new"
  },
  {
    "id": "cd93cbaa-5b47-424e-8c15-d68b11264649",
    "title": "Nepal News Evening Briefing | Friday, June 20, 2025",
    "date": "2025-06-20 15:50:05",
    "body": "KATHMANDU: Stay informed with Nepal News’ daily evening briefing, covering the most significant developments from Nepal and around the world. From politics and economy to sports, entertainment, and culture, we bring you a concise summary of the day’s top stories. Nagarjun Mayor Basnet Convicted In Money Laundering Case: Kathmandu’s Nagarjun Municipality Mayor Mohan Bahadur Basnet [...]",
    "link": "https://nepalnews.com/s/main-left/nepal-news-evening-briefing-friday-june-20-2025/",
    "source": "nepalnews",
    "status": "new"
  },
  {
    "id": "0c3d10a8-1880-415e-83a5-c5030592952d",
    "title": "Final Results",
    "date": "2025-06-20 15:50:00",
    "body": "Octopus AIM VCT plcFinal ResultsOctopus AIM VCT plc today announces the final results for the year ended 28 February 2025.Octopus AIM VCT plc (the ‘Company') is a Venture Capital Trust (VCT) which aims to provide shareholders with attractive tax-free dividends and long-term capital growth by investing in a diverse portfolio of predominantly AIM-traded companies. The Company is managed by Octopus Investments Limited (‘Octopus' or the ‘Investment Manager').Financial summary Year to 28 February 2025Year to 29 February 2024Net assets (£'000)115,383129,109Loss after tax (£'000)(6,079)(17,734)Net asset value (NAV) per share (p)150.663.3Dividends per share paid in year (p)9.95.0Total return (%)2(4.4)(13.0)Final dividend proposed (p)32.52.5Special dividend proposed (p)–4.9Ongoing charges (%)42.32.11NAV per share is calculated on the underlying assets less liabilities of the Company divided by the number of shares.2Total return is an alternative performance measure calculated as movement in NAV per share in the period plus dividends paid in the period, divided by the NAV per share at the beginning of the period.3Subject to shareholder approval at the Annual General Meeting, the proposed final dividend will be paid on 28 August 2025 to shareholders on the register on 1 August 2025.4Ongoing charges is an alternative performance measure calculated using the AIC recommended methodology.Chair's statementIntroductionFirstly, I would like to welcome all new shareholders who have joined us in the past year.The year ended 28 February 2025 was a tale of two halves for investors in smaller companies. In the first half of the year, the FTSE AIM Index delivered positive returns of 5.8% as growth in the UK economy exceeded expectations, supporting a more buoyant market for secondary fundraisings and IPO activity than had been the case for quite a while. The returns in the second half were marred by policy uncertainty surrounding the new UK Government's growth agenda. Announcements including cuts to Inheritance Tax relief on AIM shares cast a shadow on both market activity and investor sentiment which frustratingly resulted in a reversal of performance with the FTSE AIM Index delivering a negative return of 2.6% for the full year.The change in administration at the White House early in the new year triggered a decline in global market confidence, as investors anticipated policy uncertainty under the Trump Administration. Since our year-end developments including the US ‘Liberation Day' announcement of US tariffs and subsequent pauses and reversals in these policies have heightened market uncertainty, dampening investor confidence. This persistent volatility has become a defining feature of the current market environment. These concerns reflect broader fears of an economic slowdown, with the full extent of the impact on the UK economy still unclear as trade negotiations continue.For 2025 the Office for Budget Responsibility is forecasting a modest increase in UK GDP of around 1%, roughly half of the 2% growth anticipated at the end of 2024. Inflation is expected to average approximately 3% which, coupled with this subdued growth, suggests that the pace of interest rate cuts will be slower than previously anticipated. In the context of low UK equity valuations this gradual easing could act as a meaningful positive catalyst for UK equities and help restore some market confidence.It is pleasing to report that despite these background challenges, opportunities to invest in innovative, growth-oriented companies persisted. During the year under review, the AIM market raised £2 billion for new and existing companies, up from £1.7 billion the previous year. A significant part of this capital (£1.6 billion) was raised by existing AIM companies seeking additional funding. The Investment Manager deployed £7.3 million into qualifying companies, slightly down from £7.7 million the prior year, and is confident that there will continue to be sufficient opportunities to invest our funds in good companies seeking more growth capital at attractive valuations.PerformanceAmidst this backdrop of economic, market, political, and geopolitical uncertainty, the year to 28 February 2025 proved challenging for the fund. The NAV on 28 February 2025 was 50.6p per share, a decrease on the NAV of 63.3p per share reported at 29 February 2024. Adding back the 9.9p of dividends paid in the year gives a total negative return of 4.4%. In the same year, the FTSE AIM Index fell by 2.6%, the FTSE SmallCap (excluding investment companies) Index rose by 10.7% and the FTSE All-Share Index rose by 18.4%, all on a total return basis.The AIM market's underperformance compared to other UK indices over the past three years underscores investors' aversion to risk during periods of market instability and equity outflows. Investors have preferred larger more defensive companies in traditional liquid sectors, rather than significant exposure to new technology, healthcare and biotech growth stocks (sectors that form a large part of your portfolio's investments). Venture Capital Trusts (VCTs) face additional investment restrictions and must ensure they are invested in qualifying stocks. The FTSE AIM Index, while not a perfect replica, remains the most appropriate broad equity benchmark for comparison due to the nature of its underlying holdings. The FTSE SmallCap and All-Share indices provide a broader market context.DividendsIn January 2025 an interim dividend for the year to 28 February 2025 of 2.5p was paid to all shareholders. This was in addition to the 2.5p final dividend and 4.9p special dividend that had been paid in August 2024 which related to the previous financial year ended 29 February 2024. The Board is recommending a final dividend of 2.5p, resulting in a total dividend of 5.0p in respect of the year. There is no special dividend this year as no material profits have been generated on disposals during the year. The total dividend of 5.0p represents 10.5% of the year-end share price of 47.8p. This is in line with our policy of paying a minimum annual dividend of 5.0p per share or a 5% yield based on the year-end share price, whichever is the greater.Board changesAs mentioned in last year's Annual Report, Louise Nash joined the Board on 1 July 2024, and Stephen Hazell-Smith stepped down from the Board at last year's AGM on 18 July 2024.Having been on the Board for nearly nine years, and Chair since 2021, it is my intention to step down from the Board with effect from this year's Annual General Meeting on 23 July 2025, and accordingly I will not be offering myself for re-election. I am pleased to report that Joanne Parfrey, who has been a member of the Board since 2016, will be taking over as Chair with effect from the AGM.The Board is currently conducting a recruitment process, with the assistance of an external recruitment firm, Nurole Ltd, to appoint a further director of the Company in due course.Cancellation of share premium accountAt the last Annual General Meeting, shareholders voted to cancel share premium to increase the pool of distributable reserves to the amount of £18.1 million. This is a regular occurrence, and common practice, to enable the continued payment of dividends and buyback of shares. A further resolution to cancel share premium is being proposed at this year's Annual General Meeting.Dividend reinvestment schemeIn common with many other VCTs in the industry, the Company has established a Dividend Reinvestment Scheme (DRIS). Many shareholders have already taken advantage of this opportunity. For investors who do not require income, but value the additional tax relief on their reinvested dividends, this is an attractive scheme and I hope more shareholders will find it useful. In the course of the year 6,765,311 new shares have been issued under this scheme, returning £3.7 million to the Company. The final dividend referred to above will be eligible for the DRIS.Share buybacksDuring the year to 28 February 2025 the Company continued to buy back shares in the market from selling shareholders and purchased 6,705,585 ordinary shares for a total consideration of £3.7 million. We have maintained a discount of approximately 4.1% to NAV (equating to up to a 5.0% discount to the selling shareholder after costs), which the Board monitors and intends to retain as a policy which fairly balances the interests of both remaining and selling shareholders. Buybacks remain an essential practice for VCTs, as providing a means of selling is an important part of the initial investment decision and has enabled the Company to grow. As such, I hope you will all support the appropriate resolution at the AGM.Share issuesOn 23 September 2024, a prospectus offer was launched alongside Octopus AIM VCT 2 plc to raise a combined total of up to £20 million, with a £10 million over-allotment facility. In the period under review the Company raised £12.6 million after costs and issued a total of 24,270,651 shares. After the reporting period the offer closed fully subscribed on 27 March 2025.VCT statusShoosmiths LLP were engaged throughout the year to provide the Board and Investment Manager with advice concerning continuing compliance with HMRC regulations for VCTs. The Board has been advised that the Company is in compliance with the conditions laid down by HMRC for maintaining approval as a VCT. A key requirement is to maintain at least an 80% qualifying investment level. As at 28 February 2025, 85.1% of the Company's portfolio was in VCT qualifying investments.Annual General Meeting (AGM)The AGM will take place on 23 July 2025 at 10.30am. Further information can be found in the Directors' Report and Notice of Annual General Meeting. The Investment Manager will also give a live presentation to shareholders on the day of the AGM. This will enable shareholders to receive an update from the Investment Manager and provide an opportunity for questions to the Board and the Investment Manager. Formal notices will be sent to shareholders by their preferred method (email or post) and shareholders are encouraged to submit their votes by proxy. We always welcome questions from our shareholders at the AGM. Please send any questions via email to AimAGM@octopusinvestments.com by 5.00pm on 15 July 2025.OutlookAfter a prolonged period of underperformance, there are reasonable grounds for hoping that prospects for the AIM market should improve in the current financial year. Key potential drivers of improvement include regulatory reforms that facilitate investment, the recent Mansion House Accord which commits major pension providers to direct £25 billion into UK growth assets by 2030, the possible reform of VCT rules and a pipeline of IPOs and M&A activity expected to restore investor confidence. Additionally, anticipated interest rate cuts and government initiatives targeting innovation sectors such as technology, healthcare, and green energy are creating a more supportive environment. While geopolitical uncertainties persist, these combined factors position AIM for a potential rebound, which could offer attractive opportunities for growth-focused investors.The portfolio contains 87 holdings across a range of sectors with exposure to some exciting new technologies in the environmental and healthcare sectors in particular. Many of these companies remain well funded, although the challenge of raising further capital in the current market environment cannot be dismissed. The balance of the portfolio towards profitable companies remains, and the Investment Manager remains confident that there will continue to be sufficient opportunities to invest our funds in good companies seeking more growth capital at attractive valuations.Neal RansomeChairInvestment Manager's reviewIntroductionThe year ended 28 February 2025 began on a positive note. Economic uncertainty had eased, inflation approached target levels, and UK GDP growth figures were revised upwards, boosting optimism among economic commentators. Against this backdrop, the IPO market showed early signs of recovery, and secondary fundraisings had increased. Coupled with the first interest rate cut in four years during the summer, these developments restored much-needed confidence among UK investors that a sustained market recovery was imminent. Consequently, markets responded positively, with reduced volatility and company share prices reacting favourably to good news.This positive trend continued through most of the first half of the year but was interrupted ahead of the new UK Government's Autumn Budget, which introduced significant reforms to Business Property Relief (BPR) affecting tax planning. The changes (notably the reduction of relief from 100% to 50% for shares listed on markets such as AIM), heightened investor uncertainty and sparked widespread concerns about the long-term implications for UK capital markets. In response, market participants (including the London Stock Exchange, investors, industry bodies and brokers), have actively engaged with the government, focusing not only on regulatory adjustments but also on anticipated pension reforms expected to transform investment in UK equities and these conversations are ongoing.A stock market rally in December, coupled with a series of encouraging trading updates from companies in January, fostered optimism that 2025 would bring a more stable and supportive environment for UK equities. This initial momentum suggested a potential turnaround after a period of volatility, raising hopes among investors for sustained growth and improved market sentiment. However, the arrival of the new US administration and lingering uncertainty over the implementation of its policies have tempered global investor confidence. The administration's aggressive tariff regime introduces complex challenges, as the indirect consequences, such as disruptions to global supply chains and diminished business confidence. These are difficult to quantify but could materially affect global GDP growth, inflation trajectories, and interest rate policies.Market commentators widely anticipate that these tariffs will act as a drag on global economic expansion, adding to a backdrop already marked by geopolitical tensions and uneven economic recovery across regions. In recent years, global investment has become increasingly concentrated in the US, driven by strong corporate earnings and technological innovation. Yet, ongoing political uncertainty and heightened market volatility may prompt investors to reassess US market valuations, particularly within the technology sector, which has historically been a major driver of returns. Such a reassessment could shift investor focus toward alternative global markets, enhancing the appeal of the UK as a destination for both domestic and international asset allocators. It is hoped that this potential reallocation of capital flows could stimulate increased investment into UK equities, supported by relatively attractive valuations and a diverse market landscape.Encouragingly, the UK economy is projected to grow in 2025, albeit at a slower pace than initially forecast. While growth forecasts have recently been revised downward to around 1% this year, macroeconomic indicators are largely positive, with inflation only edging up slightly in recent months, and remaining moderate compared to previous years. Meanwhile, interest rates are anticipated to continue to decline, albeit at a lower than previously anticipated pace, over the course of this year and into 2026, following the first rate cut earlier in 2025 as inflationary pressures ease. This monetary easing is cautiously restoring confidence among smaller companies, which have been trading well below their long-term average valuations. The sustained corporate activity within this segment of the market highlightsthe substantial latent value in UK small businesses, suggesting considerable upside potential as market conditions improve. Overall, while challenges remain, including cost pressures caused by global uncertainties, the combination of modest UK economic growth, easing inflation, and falling interest rates is developing a more supportive environment for UK equities, particularly for smaller companies.The Alternative Investment Market (AIM)In the year to February 2025 the FTSE AIM Index fell by 2.6%. This compared to a rise in the FTSE SmallCap (excluding investment companies) of 10.7% and a rise in the FTSE All-Share Index of 18.4%, all on a total return basis. Although VCTs face additional investment restrictions, the AIM Index remains the most appropriate broad equity market benchmark for comparison, given the nature of its underlying holdings. The FTSE SmallCap and FTSE All-Share indices provide useful broader market context. Last year, the larger indices outperformed, supported by their significant exposure to major banks, aerospace and defence and pharmaceuticals. This reflected a continued investor shift away from growth and momentum stocks toward value opportunities in more traditional sectors. Additionally, changes to Business Property Relief (BPR) rules announced in the Autumn Budget proved destabilising. Historically, AIM BPR funds have been a key source of support for AIM's largest companies, but the new regulations have led to a withdrawal of investment from these funds, negatively impacting the market's overall performance relative to its peers.Consequently, the pace of IPOs on AIM remained subdued, with only 10 IPOs during the period compared to 17 in the previous financial year. While the number of exits remained broadly in line with historical levels, there has been an increasing trend of companies migrating to the main market or signalling their intention to do so. Examples of this include Gamma Communications plc and Brooks Macdonald Group plc, both of which are held in the portfolio. The total number of companies listed on AIM stood at 669 as of the end of February, representing a 9.8% decline year-on-year.Bid activity was also an important theme of the period under review with AIM seeing 27 companies bid for at an average bid premium of 56%. Positive returns were generated as a result of bids for portfolio companies Mattioli Woods plc, Learning Technologies Group plc and Intelligent Ultrasound Group plc at 34%, 34% and 17% premiums to the last traded price respectively. It is important to note that, while these bids took place at relatively modest premiums to their trading prices, due to the long-term nature of our investments these still represented significant returns on our initial investments. In total, these three bids resulted in more than £8 million of profit over our initial investment, the majority of which was received post the period end.Despite these challenges, we remain confident that AIM, and AIM Venture Capital Trusts (VCTs) in particular, continue to play a critical role in supporting the growth ambitions of smaller public companies. The opportunity to invest in qualifying companies remains. This was evidenced by the steady flow of secondary fundraisings on AIM throughout the year. In the year to 28 February 2025 AIM raised £2 billion of new capital for existing companies, an increase on the £1.7 billion raised in the previous year. This robust fundraising activity highlights that, despite prevailing market headwinds, the pipeline of qualifying companies seeking investment remains healthy. We believe this environment will continue to offer attractive opportunities to invest in exciting and innovative businesses.PerformanceAdding back the 9.9p of dividends paid in the year, the Company's NAV total return fell by 4.4% during the year. This compares with a fall in the FTSE AIM Index of 2.6%, a rise in the FTSE SmallCap (excluding investment companies) of 10.7% and a rise in the FTSE All-Share Index of 18.4%, all on a total return basis. The FTSE All-Share was lifted by strong performance of financials, consumer staples, pharmaceuticals and aerospace and defence. Financials were driven by the large banks who benefitted from improved margins as a result of the continued higher interest rate environment. Standout categories of consumer staples included tobacco and personal care where demand was resilient. The pharmaceuticals sector was primarily driven by the continued strong performance of AstraZeneca, which has an outsized impact due to being one of the largest companies in the index. Aerospace and Defence was fuelled by increasing interest in the sector due to the ongoing heightened geopolitical uncertainty which is likely to result in a significant increase in investment, particularly in Europe as the EU seeks to reduce its reliance on the US. The outperformance of the FTSE All-Share Index, driven by these sectors, was largely fuelled by the share price performance of larger more established companies with investors taking more defensive positioning due to the increased uncertainty. This trend of outperformance by traditional industries was similar for both the FTSE SmallCap (excluding investment companies) and the FTSE AIM All-Share though returns were less pronounced, markedly so for AIM. This variance in performance is somewhat explained when accounting for the differences in market cap scale of these indexes and considering the context of the additional headwinds faced by AIM. For both smaller indexes financials and consumer staples were also amongst the best performing sectors, alongside consumer services and industrials for the FTSE Small Cap (excluding investment companies) and basic materials and technology for the FTSE AIM All-Share Index. While technology does not necessarily fit well in this list this is explained by AIM's larger weighting towards technology.The underperformance in the period of the Company compared to the FTSE AIM All-Share Index is largely explained by the themes outlined above and the weightings of certain sectors of the portfolio relative to the index. The largest contributor to the FTSE AIM All-Share in the period was Keywords Studios plc which was the subject of a bid at a premium of 67% and contributed more than a percent to the performance of the index as a result. Strong performance in the period by typically non-qualifying sectors such as mining and financials also contributed to the relative underperformance.Equipmake Holdings plc was the largest detractor from the Company's performance over the year, as the business struggled with significant component price volatility, resulting in substantially higher costs than anticipated. This challenge led to a much larger loss than expected, shortening the company's cash runway and necessitating further fundraising at dilutive levels. At the end of last year, the company undertook a strategic review, including exploring a potential sale of the business. This process concluded post-period with a £5 million strategic investment from Caterpillar, accompanied by a development agreement to create electric drivetrain products for Caterpillar's applications.Next 15 Group plc reported a disappointing trading statement which subsequently led to downgrades in market expectations following the unexpected loss of its largest contract by portfolio company Mach49. While this setback was frustrating, Next 15 remains a global business with a strong portfolio of brands well-positioned to benefit from a recovery in their respective markets.Verici Dx plc's share price saw considerable volatility due to a delay in local coverage determination for its Tutivia test, which was resolved after the period end. Despite this headwind, the company achieved important milestones, including a revenue-enhancing agreement with Thermo Fisher. Judges Scientific Group downgraded revenue expectations during the year due to a delay in Geotek's large coring contract, coupled with softer demand in China. However, the company's proven business model and strong track record of delivery make it well placed to resume growth once demand normalises. Haydale Graphene Industries plc experienced a challenging trading period over the year, prompting a management change focused on executing a strategic shift toward near-term commercial opportunities. Encouragingly, the company successfully raised £3 million in capital to support this new direction.On a positive note, many companies in the portfolio delivered strong trading performances during the period, contributing positively to overall returns. Breedon Group plc was the largest contributor, announcing its long-anticipated expansion into the US market through the acquisition of BMC Enterprises Inc., a leading regional supplier of ready-mixed concrete, aggregates, and building products. This acquisition provides a valuable foothold, positioning Breedon well for further expansion in a growing but fragmented US market. Performance in Ireland was strong, delivering growth in profitability which helped offset a slightly weaker performance in Great Britain, their largest region, where there was weaker demand exacerbated further by adverse weather. Beeks Financial Cloud Group plc continued to demonstrate excellent revenue growth, driven by a series of significant contract wins and extensions. Nasdaq was confirmed as an Exchange Cloud customer, and Grupo Bolsa Mexicana de Valores became the fourth customer to adopt the Exchange Cloud product. With a strong pipeline and expanding customer base, Beeks remains well positioned to deliver sustained growth through contract expansions and new customer acquisitions. Netcall plc continued its double digit revenue growth, demonstrating the demand for its cloud solutions, which drive efficiency resulting in better customer outcomes. The company completed the acquisitions of Govtech and Parble, enhancing and complementing the existing suite of Liberty solutions and creating cross-selling opportunities which underpin future revenue growth. Diaceutics delivered another excellent performance, growing revenues at more than 30% while also increasing the quality and visibility of earnings with an improvement in the proportion of revenues which are recurring. The company won three further enterprise wide engagements, taking the total to seven, including a first commercialisation partner engagement where Diaceutics is the primary partner for a customer launching a precision medicine.In the period under review the private company holdings in our portfolio performed strongly and had their valuations increased; Hasgrove continued to see excellent growth in its annual recurring revenue which was the primary reason for its increased valuation. This was further improved by an increased valuation multiple reflective of the level of growth and profitability the company has experienced. Popsa delivered a strong trading performance in the year resulting in increased revenue expectations. The business is continuing its growth trajectory, rolling out new features and growing its customer base, reaching 1.5 million customers in 2024. The uplift in valuations contributed positively to the NAV of the Company and increased the proportion of unquoted investments in the overall value of the portfolio.Portfolio activityHaving made four qualifying investments at a total cost of £2.1 million in the first half of the year, of which one was a new investment, we added three new qualifying investments totalling £3.7 million as well as three follow-on investments totalling £1.4 million in the second half of the year. This made a total investment of £7.2 million in qualifying investments for the year, an increase on last year's £5.8 million.The four new qualifying issues invested into in the year were GETECH Group plc, Windar Photonics plc, Aurrigo International plc and RC Fornax plc. We invested £0.3 million in GETECH Group plc, an established AIM-listed company and global leader in locating subsurface resources, including critical metals essential to the energy transition. The funds raised will support the company's ongoing business development and R&D. £0.9 million was invested into Windar Photonics plc who manufacture LiDAR monitoring and optimisation solutions for wind turbines. This technology allows for optimum yaw alignment which increases the annual energy production and extends the life of the turbine by reducing wear caused by misalignment. An investment of £1.6 million was made into Aurrigo International plc which specialises in the design and development of fully integrated airside solutions for the aviation industry. The company has developed autonomous vehicles for baggage and cargo handling and has announced partnerships with several of the largest airports globally including Changi and Schipol. This autonomous technology combined with their secure management systems boosts operational efficiency and safety at airports, while supporting the reduction of emissions. We invested £1.2 million at IPO into RC Fornax plc an engineering consultancy business which provides solutions for the defence industry.The six follow-on investments into existing holdings were PCI-Pal plc, Cambridge Cognition Holdings plc, Abingdon Health plc, Ixico plc, Haydale Graphene Industries plc and GENinCode plc. We invested £1.1 million in Abingdon Health plc, a diagnostics tests business, to support the expansion of its laboratory capacity; £0.2 million in PCI-Pal plc, a provider of payment solutions and services, to strengthen its US expansion; and £0.5 million in Cambridge Cognition Holdings plc, a digital solutions provider for brain health assessment, to advance the execution of its commercial strategy. We invested £0.5 million into GENinCode plc, a leading provider in genomic testing. We supported Ixico plc, a leading neuroscience imaging business, with an investment of £0.6 million. We made a follow-on investment of £0.3 million in Haydale Graphene Industries plc which engages in the integration of graphene into next generation industrial materials.We invested £4.1 million into non-qualifying, main list stocks to manage liquidity but also provide increased UK equity market exposure where we believe that many share prices are significantly undervalued. This provides an excellent entry point and the opportunity to generate significant returns on a multi-year view. Performance of these main list stocks was broadly flat in the period, but we remain convinced of the value that exists in these businesses. We invested £0.6 million into JTC plc, a global professional services business embarking on an ambitious ‘Cosmos Era' business plan, with the goal to double the business over the next three to four years. The business has announced four acquisitions since our initial investment; £0.6 million into GSK plc, a R&D focussed multinational pharmaceutical and biotechnology company aiming to positively impact the health of billions of people. The business has delivered good financial results, grown revenues and raising dividend expectations; £0.6 million into WISE plc, a founder-led global payments solutions business with ambitions to build the best solution to move and manage money around the world. The company is continuing to expand into new territories globally and has grown to 9 million customers, with increased volumes allowing the business to cut fees for its customers, further enhancing their value proposition; £0.6 million into Cranswick plc, a leading UK food producer which operates a vertically integrated business model allowing it to provide assurances to its customers over the integrity of practices due to traceability. The company continues to invest in the resilience of its supply chain, in the period expanding their pig operations with the acquisition of JSR Genetics to further improve the quality of the company's products by ensuring animal health, playing a vital role in UK food supply; £0.6 million into Ricardo plc, a global strategic environmental and engineering consultancy group which executed a transformational acquisition and disposal to reposition the business as a leader in environmental and energy solutions, acquiring E3 advisory whilst disposing of its defence business. The business unfortunately faced unexpected headwinds with the delay of a major rail project as a result of the California wildfires; £0.6 million into Bloomsbury Publishing plc, a leading independent publisher committed to excellent and original works which continued to benefit from the popularity of author Sarah J. Maas's works and began to see the benefits of the newly acquired academic publishing business, Rowman & Littlefield. £0.5 million was invested into Bytes Technology Group plc, an IT solutions and services business which is able to roll out the use of novel AI technologies such as Copilot to customers. The business increased share of spend from customers in the period and increased operating profits. We continue to hold some existing non-qualifying AIM holdings where we see the opportunity for further share price progress.Non-qualifying investments are used to manage liquidity while awaiting new qualifying investment opportunities. During the year we increased our holdings in the FP Octopus Micro Cap Fund and the FP Octopus UK Future Generations Fund and decreased our holding in the Octopus Multi Cap Income Fund. We made a net investment of £0.7 million over the period, investing a combined £1 million and disposing of £0.3 million. The funds were net detractors in the period, with their portfolios also being exposed to many of the market headwinds discussed above. This return was disappointing, but the funds remain well positioned to benefit from the expected market recovery.In the period under review we made partial disposals of four companies, Judges Scientific plc, IDOX plc, Beeks Financial Cloud Group plc and Wise plc taking profits into rising share prices. We also fully disposed of seven holdings being Mattioli Woods plc, Renalytix plc, Cirata plc, LoopUp Group plc, Cordel Group plc, Eluceda Limited and Spectral AI Inc. Disposals made a net overall gain of £0.7 million over original cost and generated £4.9 million of cash proceeds.LiquidityThe issue of liquidity within investment funds has remained a topic of discussion this year. Shareholders may be interested to know that at the year end 56.4% of the Company's net assets were held in individual quoted shares, 13.2% were held in unquoted single company investments and 30.1% were held in cash or collective investment funds providing short-term liquidity. Shareholders should be aware that a proportion of the quoted holdings may have limited liquidity owing to the size of the investee company and the overall proportion held by the Company.VCT regulationsThere have been no further changes to the VCT regulations since the publication of the previous set of audited accounts. The key requirements are that 30% of funds raised should be invested in qualifying holdings within twelve months of the end of the accounting period in which the shares were issued, and the Company has to maintain a minimum of 80% of the portfolio (at HMRC value) invested in qualifying holdings. We remain committed to maintaining a threshold of quality and to invest where we see the potential for returns from growth. Over time there has been a gradual change to the profile of the portfolio towards earlier-stage companies. However, we continue to hold the larger market capitalisation companies, in which we invested several years ago as qualifying companies, or which we bought in the market prior to the rule changes, where we see the potential for them to continue to grow.In order to qualify, companies must:• have fewer than 250 full-time equivalent employees;• have less than £15 million of gross assets at the time of investment and no more than £16 million immediately post investment;• be less than seven years old from the date of their first commercial sale (or ten years if a knowledge intensive company) if raising State Aided (i.e. VCT) funds for the first time;• not receive more than £5 million state aided funds in the previous twelve months (£10 million for a knowledge intensive company from 6 April 2018), or more than the lifetime limit of £12 million (£20 million for a knowledge intensive company); and• produce a business plan to show that the funds are being raised for growth and development.Outlook and future prospectsThe recently announced Mansion House Accord has provided a much-needed boost to the market. The agreement, signed by 17 major UK pension providers managing over £252 billion in assets, commits to investing at least 10% of defined contribution default funds into private markets by 2030, with half of this directed toward UK assets such as infrastructure, private equity, venture capital, and private credit, unlocking an estimated £50 billion in investment, including £25 billion into UK growth sectors. This voluntary initiative aims to enhance long-term pension returns while supporting UK economic growth and innovation, with a renewed focus on revitalising AIM as a key platform for UK high-growth companies benefiting from increased pension fund capital flows. Additionally, we are hopeful that anticipated regulatory reforms for AIM, including potential amendments to VCT rules, will enhance the market's ability to attract innovative, high-growth small companies seeking capital. While we remain cautiously optimistic about the short-term outlook, we are encouraged by the strong trading performance of many companies within your portfolio and remain hopeful for continued opportunities to invest in exciting businesses at attractive valuations. There is broad consensus that UK equities are undervalued compared to other developed markets, with smaller companies in particular, presenting exceptional value at historically low valuations.The portfolio contains 87 holdings with investments across a wide range of sectors. The balance of holdings in the portfolio is towards profitable companies and many are still trading in line or above market expectations. With many small companies trading below their long-term average, we still see good growth potential when the market recovers.The Octopus Quoted Companies teamViability statementIn accordance with provision 4.31 of the UK Corporate Governance Code 2018, the Directors have assessed the prospects of the Company over a longer period than the twelve months required by the ‘going concern' provision. The Board conducted this review for a period of five years, which was considered to be a reasonable time horizon given that the Company has raised funds under an offer for subscription which closed to new applications on 27 March 2025 and, under VCT rules, subscribing investors are required to hold their investment for a five-year period in order to benefit from the associated tax reliefs. The Board regularly considers the Company's strategy, including investor demand for the Company's shares, and a five-year period is considered to be a reasonable time horizon for this.The Board carried out a robust assessment of the emerging and principal risks facing the Company and its current position. This includes the impact of the cost of living crisis, the unstable economic environment and any other risks which may adversely impact its business model, future performance, solvency or liquidity. Particular consideration was given to the Company's reliance on, and close working relationship with, the Investment Manager. The principal risks faced by the Company and the procedures in place to monitor and mitigate them are set out below.The Board has also considered the liquidity of the underlying investments and the Company's cash flow projections considering the material inflows and outflows of the Company including investment activity, buybacks, dividends and fees and found these to be realistic and reasonable. The Company's cash flow includes cash equivalents which are short-term, highly liquid investments.Based on the above assessment the Board confirms that it has a reasonable expectation that the Company will be able to continue in operation and meet its liabilities as they fall due over the five-year period to 28 February 2030.Risk and risk managementPrincipal risks, risk management and regulatory environmentIn accordance with the UK Listing Rules under which the Company operates, the Board is required to comment on the potential risks and uncertainties which could have a material impact on the Company's performance.The Board carries out a review of the risk environment in which the Company operates. The main areas of risk identified by the Board are as follows:RiskMitigationInvestment performance: The focus of the Company's investments is into VCT qualifying companies quoted on AIM and the AQSE, which by their nature entail a higher level of risk and lower liquidity than investments in larger quoted companies.The Investment Manager has significant experience and a strong track record of investing in AIM and AQSE companies, and appropriate due diligence is undertaken on every new investment. The overall risk in the portfolio is mitigated by maintaining a wide spread of holdings in terms of financing stage, age, industry sector and business models. The Board reviews the investment portfolio with the Investment Manager on a regular basis.VCT qualifying status risk: The Company is required at all times to observe the conditions for the maintenance of HMRC approved VCT status. The loss of such approval could lead to the Company and its investors losing access to the tax benefits associated with VCT status and, in certain circumstances, to investors being required to repay the initial income tax relief on their investment. The ability of the fund to invest is dependent on the pipeline of qualifying investments.Prior to investment, the Investment Manager seeks assurance from the Company's VCT status adviser that the investment will meet the legislative requirements for VCT investments.On an ongoing basis, the Investment Manager monitors the Company's compliance with VCT regulations on a current and forecast basis to ensure ongoing compliance with VCT legislation. Regular updates are provided to the Board throughout the year.The VCT status adviser formally reviews the Company's compliance with VCT regulations on a bi-annual basis and reports their results to the Board.Operational risk: The Board is reliant on the Investment Manager to manage investments effectively, and manage the services of a number of third parties, in particular the registrar and tax advisers. A failure of the systems or controls at the Investment Manager or third-party providers could lead to an inability to provide accurate reporting and to ensure adherence to VCT and other regulatory rules.The Board reviews the system of internal control, both financial and non-financial, operated by the Investment Manager (to the extent the latter are relevant to the Company's internal controls). These include controls that are designed to ensure that the Company's assets are safeguarded, that proper accounting records are maintained, and that regulatory reporting requirements are met. Feedback on other third parties is reported to the Board on at least an annual basis, including adherence to Service Level Agreements where relevant.Full story available on Benzinga.com",
    "link": "https://www.benzinga.com/pressreleases/25/06/g46031421/final-results",
    "source": "benzinga",
    "status": "new"
  },
  {
    "id": "f7eb113d-3f12-407c-be94-f92827923ef5",
    "title": "Two weeks' notice: Trump's deadline on Iran is a familiar one",
    "date": "2025-06-20 15:49:41",
    "body": "What to KnowIsrael and Iran exchanged strikes a week into their war Friday as new diplomatic efforts appeared to be underway.The White House said President Donald Trump will decide on whether the U.S. should get involved in the Israel-Iran conflict within the next two weeks. Iran’s foreign minister was scheduled to meet with his European counterparts Friday in Switzerland in an effort to deescalate the conflict. An appeals court has allowed Trump to keep control of National Guard troops he deployed to Los Angeles, where Vice President JD Vance is visiting Friday. As Europe pushes for diplomacy, Israel and Iran traded a fresh round of strikes overnight. Here’s the latest:",
    "link": "https://www.nbcdfw.com/news/national-international/donald-trump-two-weeks-deadline/3868591/",
    "source": "nbcdfw",
    "status": "new"
  },
  {
    "id": "528bbe59-6ea7-4c88-924c-9e4d52f29e68",
    "title": "These 3 Canadian Stocks Are Undervalued and Built to Outperform",
    "date": "2025-06-20 15:45:00",
    "body": "These Canadian stocks are trading below what they’re worth and could reward investors willing to wait.The post These 3 Canadian Stocks Are Undervalued and Built to Outperform appeared first on The Motley Fool Canada.",
    "link": "https://www.fool.ca/2025/06/20/these-3-canadian-stocks-are-undervalued-and-built-to-outperform/",
    "source": "fool_ca",
    "status": "new"
  },
  {
    "id": "1d0c314b-0559-49fc-954f-83cbd51d7689",
    "title": "India News | Ballia District Admin Urges Probe into Death of Doctor in Varanasi District Jail",
    "date": "2025-06-20 15:44:14",
    "body": "Get latest articles and stories on India at LatestLY. The Ballia district administration has officially requested police to investigate the death of a community health centre (CHC) superintendent in Varanasi district jail, officials said on Friday.",
    "link": "https://www.latestly.com/agency-news/india-news-ballia-district-admin-urges-probe-into-death-of-doctor-in-varanasi-district-jail-6941674.html",
    "source": "latestly",
    "status": "new"
  },
  {
    "id": "620ade44-342d-4d09-99b7-91895ab2f7ec",
    "title": "After Ahmedabad crash, Air India faces slew of passenger complaints on social media",
    "date": "2025-06-20 15:43:45",
    "body": "**Title: Air India Faces Passenger Complaints Following Ahmedabad Crash**\n\nIn the wake of a recent crash involving Air India's flight AI-171 from Ahmedabad to London, the airline is encountering a wave of criticism on social media. Passengers have voiced complaints regarding poor service, damaged baggage, mishandled refunds, and alleged harassment. This backlash on platforms like X highlights growing customer dissatisfaction with the national carrier. For the latest updates in various fields, including news, entertainment, and sports, subscribe to our WhatsApp and Telegram channels or download our app for Android and iOS.",
    "link": "https://www.siasat.com/after-ahmedabad-crash-air-india-faces-slew-of-passenger-complaints-on-social-media-3236124/",
    "source": "siasat",
    "status": "posted"
  },
  {
    "id": "259742af-316d-4bd0-b9f2-9c55ce4ef29d",
    "title": "India News | UK Navy's F-35 Fighter Jet Develops Hydraulic Failure, May Have to Be Airlifted for Return: Defence Officials",
    "date": "2025-06-20 15:42:34",
    "body": "Get latest articles and stories on India at LatestLY. The British Royal Navy F-35B fighter jet, which had made an emergency landing at Thiruvananthapuram airport, has developed a hydraulic failure, and possibly, it would be taken back in a military transport aircraft, said defence officials on Friday.",
    "link": "https://www.latestly.com/agency-news/india-news-uk-navys-f-35-fighter-jet-develops-hydraulic-failure-may-have-to-be-airlifted-for-return-defence-officials-6941671.html",
    "source": "latestly",
    "status": "new"
  },
  {
    "id": "21e70f97-9858-4c51-8a35-5b9b95ff9047",
    "title": "Trade turnover between BRICS countries tops $1 trillion mark — Putin",
    "date": "2025-06-20 15:41:43",
    "body": "\"Today, BRICS nations are already setting the bar for the development of the so-called human-centered industries, and launching major projects aimed at improving living conditions,\" the Russian leader said",
    "link": "https://tass.com/economy/1977665",
    "source": "tass",
    "status": "new"
  },
  {
    "id": "cf3d0735-4ffc-4b40-848d-61fa19f2a390",
    "title": "Cabin crew sacking: More trouble brews for Air India amid CBI probe demand",
    "date": "2025-06-20 15:40:47",
    "body": "New Delhi, June 20, 2025 Air India, currently reeling under the devastating AI 171 Boeing 787 Dreamliner crash that killed at least 270 people, including 241 passengers and crew members, on Friday faced more heat as the Aviation Industry Employees’ Guild (AIEG) demanded a CBI probe into the sacking of two cabin crew members by [...]The post Cabin crew sacking: More trouble brews for Air India amid CBI probe demand appeared first on Yes Punjab News.",
    "link": "https://yespunjab.com/cabin-crew-sacking-more-trouble-brews-for-air-india-amid-cbi-probe-demand/",
    "source": "yespunjab",
    "status": "new"
  },
  {
    "id": "e51f4681-0b66-4c2d-a91b-1154fd6162f3",
    "title": "India News | Punjab Jail Department's Head Office to Be Built in Mohali, Says Minister",
    "date": "2025-06-20 15:34:49",
    "body": "Get latest articles and stories on India at LatestLY. Punjab Jail Minister Laljit Singh Bhullar on Friday said the state government will build the head office of the Jail Department to be named 'Jail Bhawan' in Mohali.",
    "link": "https://www.latestly.com/agency-news/india-news-punjab-jail-departments-head-office-to-be-built-in-mohali-says-minister-6941652.html",
    "source": "latestly",
    "status": "new"
  },
  {
    "id": "c3b8ca42-aa4d-452b-9ff8-2627fbee207b",
    "title": "India News | PM Modi's Motorcade Makes Way for Ambulance in Bhubaneswar",
    "date": "2025-06-20 15:34:19",
    "body": "Get latest articles and stories on India at LatestLY. The motorcade of Prime Minister Narendra Modi on Friday gave way to an ambulance during his road show in Bhubaneswar.",
    "link": "https://www.latestly.com/agency-news/india-news-pm-modis-motorcade-makes-way-for-ambulance-in-bhubaneswar-6941650.html",
    "source": "latestly",
    "status": "new"
  },
  {
    "id": "5eb5cc61-1015-44b9-adc3-60952354101e",
    "title": "Essence Fashion Digest: Sergio Hudson Resort 2026 Collection, Lewis Hamilton Wears Dior, And More",
    "date": "2025-06-20 15:33:59",
    "body": "This week in fashion was filled with moments that we want to highlight. First, Sergio Hudson has unveiled their Resort 2026 collection. Next, Mahershala Ali attends the “Jurassic World: Rebirth” [...]The post Essence Fashion Digest: Sergio Hudson Resort 2026 Collection, Lewis Hamilton Wears Dior, And More appeared first on Essence.",
    "link": "https://www.essence.com/fashion/essence-fashion-digest-sergio-hudson-resort-2026-collection/",
    "source": "essence",
    "status": "new"
  },
  {
    "id": "3c88ea3c-ea45-418f-aa8b-3af289b5a251",
    "title": "Southern Nevada and Northwest Arizona on High Alert for Wildfire Risks Amid Critical Fire Weather Conditions",
    "date": "2025-06-20 15:33:43",
    "body": "The National Weather Service warns of critical fire conditions in southern Nevada and northwest Arizona, with Red Flag Warnings in place due to low humidity and gusty winds. Wind advisories and Lake Wind Advisories are also issued.",
    "link": "https://hoodline.com/2025/06/southern-nevada-and-northwest-arizona-on-high-alert-for-wildfire-risks-amid-critical-fire-weather-conditions/",
    "source": "hoodline",
    "status": "new"
  },
  {
    "id": "eb94826b-4ea4-4eda-84bf-ec7069ca6e5b",
    "title": "After Ahmedabad crash, Air India faces slew of passenger complaints on social media",
    "date": "2025-06-20 15:33:31",
    "body": "New Delhi, June 20, 2025 Just a week after the devastating crash of Air India flight AI-171 from Ahmedabad to London, the national carrier is now facing intense backlash from passengers over poor service, damaged baggage, mishandled refunds, and alleged harassment, all of which are surfacing on social media platform X. On June 12, Air [...]The post After Ahmedabad crash, Air India faces slew of passenger complaints on social media appeared first on Yes Punjab News.",
    "link": "https://yespunjab.com/after-ahmedabad-crash-air-india-faces-slew-of-passenger-complaints-on-social-media/",
    "source": "yespunjab",
    "status": "new"
  },
  {
    "id": "91a7d5b5-5105-4d50-ab2a-ee263ac66baa",
    "title": "UAE flight cancellations: Travelling this weekend? What you need to know",
    "date": "2025-06-20 15:32:54",
    "body": null,
    "link": "https://gulfnews.com/business/aviation/uae-flight-cancellations-travelling-this-weekend-what-you-need-to-know-1.500171075",
    "source": "gulfnews",
    "status": "new"
  },
  {
    "id": "05e18378-98f4-466f-87da-ff90512f619f",
    "title": "Israel-Iran Crisis Prompts UK Safety Warning as Flights from the United States to Qatar and UAE Are Suspended: New Update You Need to Know",
    "date": "2025-06-20 15:29:58",
    "body": "Amid growing concerns over rising hostilities between Israel and Iran, the United Kingdom has issued an updated travel advisory, warning citizens about significant risks tied to air travel in the Middle East.The post Israel-Iran Crisis Prompts UK Safety Warning as Flights from the United States to Qatar and UAE Are Suspended: New Update You Need to Know appeared first on Travel And Tour World.",
    "link": "https://www.travelandtourworld.com/news/article/israel-iran-crisis-prompts-uk-safety-warning-as-flights-from-the-united-states-to-qatar-and-uae-are-suspended-new-update-you-need-to-know/",
    "source": "travelandtourworld",
    "status": "new"
  },
  {
    "id": "ab85fe25-1498-4fc9-9cb2-db106ffe6509",
    "title": "US warplanes spotted flying over the UK",
    "date": "2025-06-20 15:29:56",
    "body": "Multiple F-35A stealth fighters and supporting KC-135 refuelling tankers on flew over the UK skies on Tuesday, June 17.",
    "link": "https://www.columbiagorgenews.com/news/national/us-warplanes-spotted-flying-over-the-uk/article_6bada3b5-f415-5015-8020-7a488c9c681b.html",
    "source": "columbiagorgenews",
    "status": "new"
  },
  {
    "id": "fee3c1e5-e047-4169-bb8f-3b8353de4540",
    "title": "US warplanes spotted flying over the UK",
    "date": "2025-06-20 15:29:56",
    "body": "Multiple F-35A stealth fighters and supporting KC-135 refuelling tankers on flew over the UK skies on Tuesday, June 17.",
    "link": "https://www.emporiagazette.com/news/national/article_977b9a25-48dd-5c88-88d0-1da7d83b402d.html",
    "source": "emporiagazette",
    "status": "new"
  },
  {
    "id": "76bc0837-5818-47db-a19a-6343777aa9bf",
    "title": "US warplanes spotted flying over the UK",
    "date": "2025-06-20 15:29:56",
    "body": "**US Warplanes Spotted Over the UK**\n\nOn Tuesday, June 17, several US F-35A stealth fighters, accompanied by KC-135 refueling tankers, were seen flying over the UK.",
    "link": "https://www.news-journal.com/us-warplanes-spotted-flying-over-the-uk/article_0f675b3c-5cbb-59ec-894a-4762a1987a55.html",
    "source": "news_journal",
    "status": "posted"
  },
  {
    "id": "98017472-bf63-4bcb-91a1-bc0e0c601be7",
    "title": "Will learn, emerge stronger from plane tragedy: Air India CEO in letter to staff",
    "date": "2025-06-20 15:25:44",
    "body": "**Title: Air India CEO Promises Resilience After Tragic Plane Crash**\n\nOn June 12, an Air India flight from Ahmedabad to London experienced a tragic crash shortly after take-off, leading to the loss of over 240 lives. In the aftermath, Tata Sons and Air India Chairman Natarajan Chandrasekaran, along with other key officials, visited Ahmedabad to evaluate the situation. The Air India CEO has reassured staff that the airline will learn from this tragedy and emerge stronger.",
    "link": "https://www.livemint.com/news/air-india-flight-boeing-dreamliner-ahmedabad-to-london-crash-tata-sons-chandrasekaran-singapore-airlines-vistara-11750424975037.html",
    "source": "livemint",
    "status": "posted"
  },
  {
    "id": "02119ee7-3689-48c9-9e15-0c95ef65a642",
    "title": "Is Textron Stock Underperforming the Nasdaq?",
    "date": "2025-06-20 15:25:00",
    "body": "**Title: Is Textron Stock Lagging Behind the Nasdaq?**\n\n**Article:** Textron, a major American aerospace and defense company, has seen its stock performance raise questions among investors. Lately, it appears that Textron's stock isn't keeping pace with the robust gains of the Nasdaq index. This discrepancy has sparked interest and concern among market watchers.\n\nThe Nasdaq, known for its heavy concentration of tech companies, has experienced significant growth thanks to the strong performance of tech giants. Meanwhile, Textron, which focuses on manufacturing aircraft and military equipment, hasn't matched this upward trend.\n\nInvestors and analysts are now deliberating over the potential reasons for this underperformance. Some suggest it could be due to market shifts favoring technology firms over traditional manufacturing, while others point to specific company challenges or broader economic factors affecting the defense industry.\n\nWith the market continuously evolving, Textron's future performance remains a key point of interest. Investors are eagerly watching for any strategic moves or changes that could help Textron catch up with the Nasdaq's momentum.",
    "link": "https://www.barchart.com/story/news/32975816/is-textron-stock-underperforming-the-nasdaq",
    "source": "barchart",
    "status": "posted"
  },
  {
    "id": "63de52c5-fa97-4a03-a86e-1ed45bac9333",
    "title": "India News | Exporters Suggest Shifting Shipments from Bandar Abbas Port to Chabahar Amid Iran-Israel Conflict",
    "date": "2025-06-20 15:24:20",
    "body": "**Title:** Exporters Recommend Moving Shipments to Chabahar Port Due to Iran-Israel Tensions\n\nExporters are advising a switch of cargo shipments from Iran's Bandar Abbas Port to Chabahar Port amid the ongoing Iran-Israel conflict. Industry experts warn that any escalation could significantly disrupt trade with regions like Afghanistan, Central Asia, and Russia.",
    "link": "https://www.latestly.com/agency-news/india-news-exporters-suggest-shifting-shipments-from-bandar-abbas-port-to-chabahar-amid-iran-israel-conflict-6941629.html",
    "source": "latestly",
    "status": "posted"
  },
  {
    "id": "4d2f41b7-9aa3-4aa0-9870-5983cdf84eb2",
    "title": "Carbon-Neutral Fuels Strategic Business Report 2025: Global Decarbonization Targets Throw the Spotlight on Carbon-Neutral Fuels as Next-Gen Energy Alternatives - A $126.5 Billion Market by 2030",
    "date": "2025-06-20 15:23:00",
    "body": "**Title:** Carbon-Neutral Fuels: Powering the Future with a $126.5 Billion Market by 2030\n\nCarbon-neutral fuels are gaining attention as crucial next-generation energy solutions, projected to become a $126.5 billion market by 2030. With the push for global decarbonization, these fuels are essential in reducing emissions, especially in sectors that are challenging to clean up. The market's growth is fueled by innovations in green hydrogen and synthetic fuels, along with supportive policies and technological advances. The U.S. and China are rapidly expanding their carbon-neutral fuel initiatives, highlighting their role in achieving global net-zero targets. As new international tariff developments unfold, these fuels are set to be a cornerstone of the worldwide energy transition.",
    "link": "https://www.globenewswire.com/fr/news-release/2025/06/20/3102833/28124/en/Carbon-Neutral-Fuels-Strategic-Business-Report-2025-Global-Decarbonization-Targets-Throw-the-Spotlight-on-Carbon-Neutral-Fuels-as-Next-Gen-Energy-Alternatives-A-126-5-Billion-Marke.html",
    "source": "globenewswire_fr",
    "status": "edited"
  },
  {
    "id": "a77cca6a-cdfd-44d3-b4da-e3ff820ed182",
    "title": "India News | Earthquake of Magnitude 3.0 Hits Assam's Dibrugarh",
    "date": "2025-06-20 15:20:24",
    "body": "Get latest articles and stories on India at LatestLY. \"EQ of M: 3.0, on June 20, 19:14:06 IST, Lat: 27.60 N, Long: 94.97 E, Depth: 7 Km, Location: Dibrugarh, Assam.\" NCS posted on X.",
    "link": "https://www.latestly.com/agency-news/india-news-earthquake-of-magnitude-3-0-hits-assams-dibrugarh-6941622.html",
    "source": "latestly",
    "status": "new"
  },
  {
    "id": "078660e5-d283-4130-9bbe-495ddbed75a9",
    "title": "Boeing ‘ready to listen’ as world waits to hear Air India crash cause",
    "date": "2025-06-20 15:20:18",
    "body": "Le BOURGET, France — Boeing kept a low profile at this year’s Paris Air Show, an industry event where aerospace giants gather to discuss, showcase and strategize the future of flying.",
    "link": "https://www.columbian.com/news/2025/jun/20/boeing-ready-to-listen-as-world-waits-to-hear-air-india-crash-cause/",
    "source": "columbian",
    "status": "new"
  },
  {
    "id": "114fef00-2281-4f9e-92b2-8ca835cff5bb",
    "title": "F-35 Fighter Jet Faces Mechanical Woes in Kerala, Sparks Controversy And Humor | #therightstand",
    "date": "2025-06-20 15:20:12",
    "body": "The F-35 fighter jet faces serious mechanical issues in Kerala, raising concerns about its reliability. With multiple hydraulic failures reported, the British Navy's predicament has sparked interest in rival aircraft like the Rafale, as the aviation market heats up in Southeast Asia. n18oc_indiaWatch",
    "link": "https://www.news18.com/videos/india/f-35-fighter-jet-faces-mechanical-woes-in-kerala-sparks-controversy-and-humor-therightstand-9396096.html",
    "source": "news18",
    "status": "new"
  },
  {
    "id": "46ddcb0f-b250-4de6-90ec-24a704d9b538",
    "title": "How airlines navigate airspaces as Israel and Iran trade missiles",
    "date": "2025-06-20 15:19:06",
    "body": "The global airline industry is taking special interest in how the escalating conflict between Israel and Iran plays out. The priority of every airline in such situations is passenger safety. But how can they ensure this?",
    "link": "https://www.firstpost.com/explainers/how-airlines-navigate-airspaces-as-israel-and-iran-trade-missiles-13898619.html",
    "source": "firstpost",
    "status": "new"
  },
  {
    "id": "c94c8143-5b55-4159-a30f-cc53baa38b53",
    "title": "Govt committed to protecting intellectual property: Minister Pandey",
    "date": "2025-06-20 15:18:53",
    "body": "**Title: Government Pledges Stronger Protection for Intellectual Property**\n\nIn a recent event at Singha Durbar, Kathmandu, Cultural, Tourism, and Civil Aviation Minister Badri Prasad Pandey emphasized the government's dedication to enhancing intellectual property rights in Nepal. Minister Pandey assured attendees that new laws are being developed to replace outdated regulations, aiming to better safeguard creative and innovative works. This move highlights the government's focus on addressing current challenges and seizing opportunities in the realm of intellectual property protection.",
    "link": "https://nepalnews.com/s/nation/govt-committed-to-protecting-intellectual-property-minister-pandey/",
    "source": "nepalnews",
    "status": "edited"
  },
  {
    "id": "49afadd7-1d63-4e93-87d2-c475a9c5242b",
    "title": "India News | MP CM Mohan Yadav Instructs Officials to Conduct Surveys in Forest Villages, Provide Land Leases to Individuals Left out",
    "date": "2025-06-20 15:18:26",
    "body": "**Title:** Land Leases for Forest Villages: Madhya Pradesh's New Initiative\n\nMadhya Pradesh Chief Minister Mohan Yadav has announced plans to issue land leases to residents of forest villages who have been previously overlooked. A comprehensive survey will be conducted to identify individuals eligible for these leases. Highlighting the importance of the state's rich natural resources, Yadav emphasized that Madhya Pradesh's dense forests are its key identity. He urged the Forest Department to enhance the region's forest resources and wildlife tourism to boost long-term income.",
    "link": "https://www.latestly.com/agency-news/india-news-mp-cm-mohan-yadav-instructs-officials-to-conduct-surveys-in-forest-villages-provide-land-leases-to-individuals-left-out-6941620.html",
    "source": "latestly",
    "status": "edited"
  },
  {
    "id": "6c1a2cfb-97ea-40b1-aa02-bc5243931055",
    "title": "India News | Bihar BJP MLA Disqualified from Assembly Following Conviction in Assault Case",
    "date": "2025-06-20 15:18:14",
    "body": "Get latest articles and stories on India at LatestLY. Bihar BJP MLA from Alinagar constituency, Mishrilal Yadav, was on Friday disqualified from the state Assembly following his conviction in an assault case of 2019 by the MP/MLA Court of Darbhanga district.",
    "link": "https://www.latestly.com/agency-news/india-news-bihar-bjp-mla-disqualified-from-assembly-following-conviction-in-assault-case-6941617.html",
    "source": "latestly",
    "status": "new"
  },
  {
    "id": "cf80fd8b-d93b-4d02-9a0e-9d603d2bd8bc",
    "title": "'Will Not Release Aircraft, If...': Air India CEO Campbell Wilson Assures Public Of Transparency After Ahmedabad Tragedy",
    "date": "2025-06-20 15:17:25",
    "body": "(MENAFN - Live Mint) Air India Chief Executive Officer (CEO) and Managing Director (MD) Campbell Wilson on Friday reassured the public and employees that the airline's fleet – particularly its ...",
    "link": "https://menafn.com/1109702299/Will-Not-Release-Aircraft-If-Air-India-CEO-Campbell-Wilson-Assures-Public-Of-Transparency-After-Ahmedabad-Tragedy",
    "source": "menafn",
    "status": "new"
  },
  {
    "id": "af96aecf-3f2e-4839-9e66-fa48263d1cd6",
    "title": "Will Learn, Emerge Stronger From Plane Tragedy: Air India CEO In Letter To Staff",
    "date": "2025-06-20 15:17:23",
    "body": "(MENAFN - Live Mint) Mumbai: Air India chief executive officer Campbell Wilson has assured employees that the airline will learn from the tragic plane crash that killed over 240 people on 12 June ...",
    "link": "https://menafn.com/1109702295/Will-Learn-Emerge-Stronger-From-Plane-Tragedy-Air-India-CEO-In-Letter-To-Staff",
    "source": "menafn",
    "status": "new"
  },
  {
    "id": "8ae8a2ee-5784-4058-804a-33f2dd9a8339",
    "title": "Unforgettable Heroine Maria Sokenu",
    "date": "2025-06-20 15:16:32",
    "body": "The good that people do often live after them. Such is the life of this woman that was not only a trailblazer in the banking industry, but a philanthropist to ... Source",
    "link": "https://blueprint.ng/unforgettable-heroine-maria-sokenu/",
    "source": "blueprint",
    "status": "new"
  },
  {
    "id": "b6e08f9e-9d80-4eb5-8e0d-1b7b94615e22",
    "title": "India News | Gurugram: 7 Foreign Nationals, Mizoram Native Held for Drug Trafficking",
    "date": "2025-06-20 15:12:33",
    "body": "Get latest articles and stories on India at LatestLY. Eight people, including seven foreign nationals, were arrested in Gurugram for drug trafficking and narcotics worth Rs 1 crore seized from their possession, police said on Friday.",
    "link": "https://www.latestly.com/agency-news/india-news-gurugram-7-foreign-nationals-mizoram-native-held-for-drug-trafficking-6941608.html",
    "source": "latestly",
    "status": "new"
  },
  {
    "id": "fde7039a-0fc7-4cf8-b62a-7ab274ba56d8",
    "title": "India News | Punjab and Haryana HC Dismisses PIL Against Online Opinion Trading Platforms, Cites Adequate Legal Framework",
    "date": "2025-06-20 15:12:32",
    "body": "Get latest articles and stories on India at LatestLY. The Punjab and Haryana High Court on Friday dismissed a public interest litigation (PIL) seeking a ban on online opinion trading platforms, gaming applications, and related advertisements.",
    "link": "https://www.latestly.com/agency-news/india-news-punjab-and-haryana-hc-dismisses-pil-against-online-opinion-trading-platforms-cites-adequate-legal-framework-6941607.html",
    "source": "latestly",
    "status": "new"
  },
  {
    "id": "978405a2-6f4d-4516-96ba-7389468af096",
    "title": "Dublin Airport operator is issued legal warning over passenger cap breach",
    "date": "2025-06-20 15:11:42",
    "body": "**Title: Dublin Airport Warned for Surpassing Passenger Limit**\n\nDublin Airport's operator, DAA, has been issued a legal warning by Fingal County Council for exceeding its allowed passenger count. This enforcement notice indicates the airport handled more travelers than permitted. In reaction, DAA criticized the current planning system as disorganized and called for a more efficient regulatory approach.",
    "link": "https://www.irishtimes.com/ireland/2025/06/20/dublin-airport-operator-is-issued-legal-warning-over-passenger-cap-breach/",
    "source": "irishtimes",
    "status": "edited"
  },
  {
    "id": "f225ef81-0b13-48e2-9e24-675cdf3cccc3",
    "title": "India News | Himachal Pradesh HC Directs State Govt to Grant Paternity Leave to Regularised Employees",
    "date": "2025-06-20 15:08:32",
    "body": "**Title: Himachal Pradesh High Court Grants Paternity Leave to State Employees**\n\nIn a move to bolster parental rights for government employees, the Himachal Pradesh High Court has instructed the State Government to recognize leave taken by a regularised Assistant Professor as paternity leave. This decision marks a significant step forward in supporting parental responsibilities among government staff in the state.",
    "link": "https://www.latestly.com/agency-news/india-news-himachal-pradesh-hc-directs-state-govt-to-grant-paternity-leave-to-regularised-employees-6941599.html",
    "source": "latestly",
    "status": "posted"
  },
  {
    "id": "87c2c909-327f-495a-bf71-9136159865e8",
    "title": "Courting Southeast Asia: How Russia Exploits Gaps in Western Credibility",
    "date": "2025-06-20 15:08:00",
    "body": "**Title: Russia Seizes Opportunities in Southeast Asia Amid Western Doubts**\n\nArticle: Vladimir Putin is finding success in Malaysia and Indonesia by tapping into frustrations about perceived Western double standards, especially regarding Gaza. This strategy highlights Russia's growing influence in Southeast Asia as it capitalizes on regional discontent.",
    "link": "https://thediplomat.com/2025/06/courting-southeast-asia-how-russia-exploits-gaps-in-western-credibility/",
    "source": "thediplomat",
    "status": "posted"
  },
  {
    "id": "10b13242-cf82-4f1e-92d7-981799c601f5",
    "title": "India News | States Free to Choose Any 3 Indian Languages Under NEP: RSS Body",
    "date": "2025-06-20 15:06:17",
    "body": "**Title: States Can Choose Any 3 Indian Languages for Schools Under New Education Policy**\n\nUnder India's New Education Policy (NEP), states have the flexibility to select any three of the 22 official Indian languages for their school curriculums. This was clarified by Vidya Bharati's national president, Ravindra Kanhere, who addressed concerns from the Tamil Nadu government about the potential imposition of Hindi by the central government. The NEP aims to promote linguistic diversity without enforcing any specific language.",
    "link": "https://www.latestly.com/agency-news/india-news-states-free-to-choose-any-3-indian-languages-under-nep-rss-body-6941592.html",
    "source": "latestly",
    "status": "posted"
  },
  {
    "id": "127580ca-5a84-4e29-811c-06b9fb85cdd6",
    "title": "UK Gov't Works With Aviation Industry To Tackle Irregular Migration",
    "date": "2025-06-20 15:05:04",
    "body": "(MENAFN - Kuwait News Agency (KUNA))LONDON, June 20 (KUNA) -- UK government launched on Friday a joint program for cooperation with the aviation companies in Europe to tackle the problem of illegal ...",
    "link": "https://menafn.com/1109701981/UK-Govt-Works-With-Aviation-Industry-To-Tackle-Irregular-Migration",
    "source": "menafn",
    "status": "new"
  },
  {
    "id": "17d98faa-6df1-4020-b500-0ffb761fb2a2",
    "title": "Iran Extends Aviation Curbs Until Sat. Morning",
    "date": "2025-06-20 15:05:04",
    "body": "(MENAFN - Kuwait News Agency (KUNA))TEHRAN, June 20 (KUNA) -- The Iranian Ministry of Roads and Urban Development said that Iran's airspace will remain shut until 2:00 am. Saturday, local time ...",
    "link": "https://menafn.com/1109701985/Iran-Extends-Aviation-Curbs-Until-Sat-Morning",
    "source": "menafn",
    "status": "new"
  },
  {
    "id": "dcf67049-9a23-426c-9217-ecb53f2fc097",
    "title": "Air India cabin crew sacking: Aviation Guild demands CBI probe, alleges suppression of safety concerns",
    "date": "2025-06-20 15:04:40",
    "body": "AIEG, Air India, CBI",
    "link": "https://www.thestatesman.com/india/air-india-cabin-crew-sacking-aviation-guild-demands-cbi-probe-alleges-suppression-of-safety-concerns-1503447795.html",
    "source": "thestatesman",
    "status": "new"
  },
  {
    "id": "d89c502a-4d51-47b6-b678-4f1e880e1feb",
    "title": "India News | Significant Leap with Development of Indigenous Post-quantum Cryptography Applications, Says Army",
    "date": "2025-06-20 15:02:32",
    "body": "Get latest articles and stories on India at LatestLY. The Indian Army on Friday said it has taken a \"significant leap\" in harnessing quantum technologies with the development of indigenous post-quantum cryptography applications, a move that aims to bolster its capabilities across domains and to ensure the force remains future ready in \"ever-evolving technological landscape\".",
    "link": "https://www.latestly.com/agency-news/india-news-significant-leap-with-development-of-indigenous-post-quantum-cryptography-applications-says-army-6941580.html",
    "source": "latestly",
    "status": "new"
  },
  {
    "id": "d69e047b-6e74-4f52-b8f7-b2b7b3f49232",
    "title": "Watch: SpaceX Starship explodes during test in Texas. What's next for Elon Musk's company?",
    "date": "2025-06-20 15:01:41",
    "body": null,
    "link": "https://www.yahoo.com/news/watch-spacex-starship-explodes-during-150141021.html",
    "source": "yahoo",
    "status": "new"
  },
  {
    "id": "e19d64c8-dc4a-4f36-a28e-ef6041f80515",
    "title": "Air Transat Will Start Flying To Europe's 2nd Busiest Airport This Winter",
    "date": "2025-06-20 15:00:19",
    "body": "**Title: Air Transat to Launch Flights to Major European Airport This Winter**\n\nAir Transat is gearing up to expand its service by offering flights to Europe's second busiest airport starting December 6, 2025. This new route will provide travelers with more options for their winter travel plans. Keep an eye out for more details as the date approaches!",
    "link": "https://simpleflying.com/air-transat-flights-europe-second-busiest-airport/",
    "source": "simpleflying",
    "status": "edited"
  },
  {
    "id": "376fb541-b2ed-4006-bb87-ae18ef459ee2",
    "title": "AIROS Skyview to Offer Up to 11% Discount on Tokyo Night Helicopter Tours During June and July",
    "date": "2025-06-20 15:00:00",
    "body": "A new way to experience Tokyo by seeing the night view from the sky CHIYODA-KU, TOKYO, JAPAN, June 20, 2025 /EINPresswire.com/ -- AIROS Skyview (Operated by AirX Inc. Based in Chiyoda Ward, Tokyo. CEO: Kiwamu Tezuka), the top provider of helicopter tours in Japan, has announced a sale on night helicopter rides around Tokyo in June and July 2025. ■ About AIROS SkyviewAIROS Skyview has received positive reviews from foreign travelers and domestic high-worth-individuals as a new way to experience Tokyo and the rest of Japan.In particular, the “Tokyo Helicopter Tour,” is a luxurious flight over Tokyo that offers views of the night skyline and Mount Fuji, is extremely popular both day and night.AIROS Skyview is very popular with American tourists and receives around 15 reservations from America per month on average.AIROS is a recipient of TripAdvisor Travelers’ Choice 2024 and offers support in English, so even travelers who cannot speak Japanese can reserve a tour with ease. Travelers can book a tour through the English reservation site or OTAs such as Viator. ■ Exclusive discounts for June and July|Tokyo Night Helicopter Tour (Departs from Saitama Misato Heliport)18-minute course: Standard ¥112,000 (About $720)→ Discount from ¥99,000 (About $640)24-minute course: Standard ¥132,000 (About $850)→ Discount from ¥120,000 (About $770)48-minute course: Standard ¥238,000 (About $1,530)→ Discount from ¥220,000 (About $1,420)*Prices for one helicopter/Max. 4 people per helicopterDetails and booking: https://skyview.airos.us.com/saitama/night ■ Highlights of Tokyo helicopter ridesTokyo Day Flight: Views of Japanese landmarks such as Tokyo Tower, Tokyo Sky Tree, Mt. FujiTokyo Night Flight: Perfect for romantic occasions such as proposals, anniversaries, and honeymoonsFlexible departure: Possible to leave from helipads outside of Tokyo, such as Chiba and KanagawaLimited time tours, including flights with views of summer fireworks festivals, are also available.For information on firework plans please visit: https://skyview.airos.us.com/fireworks ■Expanding beyond Tokyo, helicopter tours all across JapanAIROS Skyview also offers flights in other major cities across Japan, including Osaka, Kyoto, and Hiroshima. Flights in Okinawa and Hokkaido are planned for Summer 2025.For information on flights in other areas of Japan please visit: https://skyview.airos.us.com/ ■Helicopters for transportation within JapanIn addition to tours, AIROS Skyview also offers helicopter trips for transportation, including Tokyo to Fuji (about 35 minutes). These flights can bypass traffic and are perfect for business and travel.For information on flights from Tokyo to Mt. Fuji: https://skyview.airos.us.com/en/transport/fuji/511Tokyo Heliport is located about 20 minutes by car from Tokyo Station and Haneda Airport. There are also flights available from Narita Airport to Tokyo.For information on transportation from Narita Airport please visit:https://skyview.airos.us.com/en/transport/narita/509 ■ Reservations and Detailshttps://skyview.airos.us.com/Reservations and other inquiries are welcome from individual travelers, travel agents, and representatives. About AirX Inc.Company name: AirX Inc.Established February 23, 2015CEO: Kiwamu Tezuka [AIROS Skyview]https://skyview.airos.us.comInstagram:https://www.instagram.com/airos_skyviewFacebook:https://www.facebook.com/airos.skyview AirX strives to build the next generation of aviation infrastructure through aerial transportation services using helicopters, private jets, and eVTOL (flying cars). With the largest number of helicopter flights in Japan, AirX is leading the air mobility revolution.Shunka Katsuta AirX Inc. shunka.katsuta@airx.co.jp Legal Disclaimer: EIN Presswire provides this news content \"as is\" without warranty of any kind. We do not accept any responsibility or liability for the accuracy, content, images, videos, licenses, completeness, legality, or reliability of the information contained in this article. If you have any complaints or copyright issues related to this article, kindly contact the author above.",
    "link": "https://kalkinemedia.com/news/world-news/airos-skyview-to-offer-up-to-11-discount-on-tokyo-night-helicopter-tours-during-june-and-july",
    "source": "kalkinemedia",
    "status": "new"
  },
  {
    "id": "10e4560b-4d47-4c2a-9690-b9d8e53b3a52",
    "title": "India News | Operation Sindhu: Two Evacuation Flights from Iran Region to Land in Delhi Tonight",
    "date": "2025-06-20 14:58:29",
    "body": "**Title: Operation Sindhu: Evacuation Flights from Iran Region Arriving in Delhi Tonight**\n\nUnder Operation Sindhu, two evacuation flights carrying Indian nationals from Mashhad, Iran, and Ashgabat, Turkmenistan, are set to arrive in Delhi tonight. These flights will land at 11:30 PM and 3:00 AM, respectively, on June 20, 2025. This operation comes as a response to the ongoing conflict between Israel and Iran, ensuring the safe return of Indian citizens. Stay updated with the latest on India at LatestLY.",
    "link": "https://www.latestly.com/agency-news/india-news-operation-sindhu-two-evacuation-flights-from-iran-region-to-land-in-delhi-tonight-6941573.html",
    "source": "latestly",
    "status": "edited"
  },
  {
    "id": "b818dd4a-8407-4d3e-a1cf-81693fbdff8c",
    "title": "3 Tech Stocks Surging with Heavy Institutional Accumulation",
    "date": "2025-06-20 14:58:00",
    "body": null,
    "link": "https://www.investing.com/analysis/3-tech-stocks-surging-with-heavy-institutional-accumulation-200662540",
    "source": "investing_us",
    "status": "new"
  },
  {
    "id": "e6f4a942-61ec-4d50-ba59-bdeef5c16459",
    "title": "Doctor shares five ways to stay safe under the sun this year as heatwave hits UK",
    "date": "2025-06-20 14:54:58",
    "body": "Dr Pallavi Bradshaw has shared the top five ways to stay safe under the sun this year",
    "link": "https://www.birminghammail.co.uk/news/uk-news/doctor-shares-five-ways-stay-31901984",
    "source": "birminghammail",
    "status": "new"
  },
  {
    "id": "a963f489-e316-405e-be46-a71a69d729bb",
    "title": "Saudia Named \"Best Airline Staff Service” at the 2025 Skytrax Awards",
    "date": "2025-06-20 14:53:05",
    "body": "The airline climbs to 17th place in global ranking, reflecting excellence across the guest journeyPicture of Saudia team receiving Skytrax award",
    "link": "https://www.manilatimes.net/2025/06/20/tmt-newswire/globenewswire/saudia-named-best-airline-staff-service-at-the-2025-skytrax-awards/2137096",
    "source": "manilatimes",
    "status": "new"
  },
  {
    "id": "1f301848-c82c-4ed0-b7ee-2ff4133613fb",
    "title": "Ghost flights spotted from China to Iran as Beijing signals entry into conflict",
    "date": "2025-06-20 14:52:58",
    "body": null,
    "link": "https://interestingengineering.com/culture/china-ghost-flights-to-iran-tracked",
    "source": "interestingengineering",
    "status": "new"
  },
  {
    "id": "63774b94-f2f5-4f30-a19e-fbe4c62bb82d",
    "title": "India News | Changes in Shashi Tharoor Due to Understanding People's Interests: Suresh Gopi",
    "date": "2025-06-20 14:52:28",
    "body": "Get latest articles and stories on India at LatestLY. Union Minister of State Suresh Gopi on Friday said that Congress MP Shashi Tharoor has to decide whether he wants to join the BJP and the changes seen in him were the outcome of understanding the people's interests.",
    "link": "https://www.latestly.com/agency-news/india-news-changes-in-shashi-tharoor-due-to-understanding-peoples-interests-suresh-gopi-6941564.html",
    "source": "latestly",
    "status": "new"
  },
  {
    "id": "b720b913-c86d-4121-afbb-062c76e6ff67",
    "title": "India News | Jharkhand HC Reserves Order in Bail Plea of Former Minister Alamgir Alam",
    "date": "2025-06-20 14:52:17",
    "body": "Get latest articles and stories on India at LatestLY. The Jharkhand High Court on Friday reserved its order in a petition filed by former minister Alamgir Alam seeking bail pursuant to his arrest in the alleged tender scam by the Enforcement Directorate.",
    "link": "https://www.latestly.com/agency-news/india-news-jharkhand-hc-reserves-order-in-bail-plea-of-former-minister-alamgir-alam-6941563.html",
    "source": "latestly",
    "status": "new"
  },
  {
    "id": "86d460f9-6216-464b-b1f4-2d32d7c6bca5",
    "title": "Government begins Rs180 million upgrade of Skardu International Airport",
    "date": "2025-06-20 14:50:59",
    "body": "Construction work is expected to start within a year after the completion of the detailed design and PC-1The post Government begins Rs180 million upgrade of Skardu International Airport appeared first on Profit by Pakistan Today.",
    "link": "https://profit.pakistantoday.com.pk/2025/06/20/government-begins-rs180-million-upgrade-of-skardu-international-airport/",
    "source": "pakistantoday",
    "status": "new"
  },
  {
    "id": "94804cb9-7404-4474-8e5d-d850997fcd8a",
    "title": "India News | MP: CM Yadav Attends State-level Gaushala Conference, Announces Animal Husbandry Dept to Be Known as 'Gaupalan' Dept Too",
    "date": "2025-06-20 14:22:31",
    "body": "Get latest articles and stories on India at LatestLY. \"Today, a state-level Gaushal conference was organised here in Bhopal and we distributed various prizes to cowshed operators across the state, along with funds for their operation--some 5 lakh, 3 lakh, or 2 lakh rupees. A total of around 90 crore rupees was transferred to all cowsheds with a single click. With the Acharya Vidyasagar Gau Samvardhan Scheme and Dr Bhimrao Ambedkar Kamdhenu Yojana, people should connect with Gaupalan and increase their income. We are working in the direction that farmers should connect with milk production along the farming, and increase income,\" CM Yadav told reporters.",
    "link": "https://www.latestly.com/agency-news/india-news-mp-cm-yadav-attends-state-level-gaushala-conference-announces-animal-husbandry-dept-to-be-known-as-gaupalan-dept-too-6941501.html",
    "source": "latestly",
    "status": "new"
  },
  {
    "id": "55dd7a5f-bd27-4229-897c-625a6bf9d746",
    "title": "DNA samples have matched waiting for handover of mortal remains Kin of Pune-based crash victim",
    "date": "2025-06-20 14:22:13",
    "body": "Pune, Jun 20 (PTI) The mortal remains of Pune-based Irfan Shaikh, who was part of the crew on Air India",
    "link": "https://www.theweek.in/wire-updates/national/2025/06/20/bom23-mh-planecrash-cabin-crew.html",
    "source": "theweek_in",
    "status": "new"
  },
  {
    "id": "37206797-194b-4b24-aeed-35a887ecfe9d",
    "title": "Jeff Bezos and Lauren Sánchez wedding: Everything we know about the tech bro and glamazon’s nuptials",
    "date": "2025-06-20 14:18:34",
    "body": "It’s being hailed as the ‘wedding of the century’. Here’s everything we know, from the 27 outfit changes to the Venetian gift bags and helicopter landing pads",
    "link": "https://www.standard.co.uk/lifestyle/jeff-bezos-lauren-sanchez-wedding-amazon-what-to-know-b1234041.html",
    "source": "standarduk",
    "status": "new"
  },
  {
    "id": "7c056412-6627-46d2-91b0-d197129eec86",
    "title": "India News | Delhi CM Rekha Gupta Launches Song Ahead of Yoga Day",
    "date": "2025-06-20 14:18:28",
    "body": "Get latest articles and stories on India at LatestLY. Delhi Chief Minister Rekha Gupta on Friday, a day before International Yoga Day, launched a song on yoga sung by music composer Amit Trivedi.",
    "link": "https://www.latestly.com/agency-news/india-news-delhi-cm-rekha-gupta-launches-song-ahead-of-yoga-day-6941485.html",
    "source": "latestly",
    "status": "new"
  },
  {
    "id": "86998287-24ff-48a3-a9e6-331071b39fdb",
    "title": "India News | Assam Govt Raids Businesses Evading Tax Payment",
    "date": "2025-06-20 14:18:14",
    "body": "Get latest articles and stories on India at LatestLY. The Assam government is cracking the whip on tax evasion with raids in business establishments in different parts of the state leading to uncovering of tax suppression of around Rs 5.80 crore, official statements said on Friday.",
    "link": "https://www.latestly.com/agency-news/india-news-assam-govt-raids-businesses-evading-tax-payment-6941483.html",
    "source": "latestly",
    "status": "new"
  },
  {
    "id": "ed9db300-39c0-46a5-891e-5dbbda4f98d1",
    "title": "Switches, Dimmers and Receptacles Market reaching a valuation of around $28 billion by 2034 | Exactitude Consultancy",
    "date": "2025-06-20 14:18:00",
    "body": "Switches, Dimmers and Receptacles Market Switches, Dimmers and Receptacles Market",
    "link": "https://www.globenewswire.com/news-release/2025/06/20/3102796/0/en/Switches-Dimmers-and-Receptacles-Market-reaching-a-valuation-of-around-28-billion-by-2034-Exactitude-Consultancy.html",
    "source": "globenewswire",
    "status": "new"
  },
  {
    "id": "8ecdea18-7269-4d08-9fb2-89ccb9604165",
    "title": "Switches, Dimmers and Receptacles Market reaching a valuation of around $28 billion by 2034 | Exactitude Consultancy",
    "date": "2025-06-20 14:18:00",
    "body": "Switches, Dimmers and Receptacles Market Switches, Dimmers and Receptacles Market",
    "link": "https://www.globenewswire.com/fr/news-release/2025/06/20/3102796/0/en/Switches-Dimmers-and-Receptacles-Market-reaching-a-valuation-of-around-28-billion-by-2034-Exactitude-Consultancy.html",
    "source": "globenewswire_fr",
    "status": "new"
  },
  {
    "id": "1a452205-10c4-4223-9be8-03f85cb6378a",
    "title": "Switches, Dimmers and Receptacles Market reaching a valuation of around $28 billion by 2034 | Exactitude Consultancy",
    "date": "2025-06-20 14:18:00",
    "body": "Luton, Bedfordshire, United Kingdom, June 20, 2025 (GLOBE NEWSWIRE) -- As of 2024, the global market for switches, dimmers, and receptacles stands at an estimated $18 billion, reflecting robust demand across residential, commercial, and industrial sectors. The market is anticipated to grow steadily, reaching a valuation of around $28 billion by 2034, driven by evolving technological landscapes and increasing consumer demand for smart, efficient electrical control systems. This represents a Compound Annual Growth Rate (CAGR) of approximately 4.5% over the forecast period from 2025 to 2034.Download PDF Brochure: https://exactitudeconsultancy.com/request-sample/65306 The growing emphasis on energy efficiency, smart home integration, and aesthetic control systems is reshaping this market. Technological progress, particularly the integration of Internet of Things (IoT) technologies and wireless control systems, is steering product innovation. At the same time, sustainable construction practices and government incentives around energy conservation are further supporting market growth.Product Type AnalysisWithin this diverse market, switches continue to lead in terms of revenue. Their core functionality in residential and commercial spaces, combined with rapid innovation in smart switches, makes them the most in-demand product category. These intelligent switches offer enhanced control features such as voice activation, mobile app integration, and real-time usage monitoring, making them increasingly popular among tech-savvy consumers.The dimmer segment is experiencing notable growth, driven by rising consumer awareness of energy conservation and demand for customizable lighting experiences. Dimmers allow users to adjust lighting intensity, which not only contributes to energy savings but also enhances ambiance. As smart lighting systems become more accessible, smart dimmers are emerging as essential components in connected homes.Receptacles, once considered a basic electrical component, are now evolving through the introduction of smart receptacles. These innovative outlets provide features such as remote power control, USB integration, surge protection, and automation, responding to the growing number of electronic devices in modern households. Although traditionally a smaller segment, receptacles are becoming more significant due to rising consumer expectations for safety, convenience, and energy management.Technology LandscapeThe market is segmented into two primary technology types: conventional and smart systems. While conventional switches and dimmers remain dominant due to their affordability, ease of installation, and familiarity, the smart technology segment is expanding rapidly. As consumers become more environmentally conscious and tech-oriented, they are seeking advanced solutions that offer greater control, automation, and energy savings.Smart switches, dimmers, and receptacles are transforming electrical systems by enabling remote access, programmable schedules, voice control, and energy monitoring. The surge in connected devices, rising adoption of smart assistants (like Alexa and Google Home), and advancements in wireless protocols have made these smart technologies increasingly viable for both new constructions and retrofits.Application InsightsThe residential sector remains the largest consumer of switches, dimmers, and receptacles, fueled by the global rise in smart homes and the widespread push for home automation systems. From energy-efficient lighting to remotely controlled outlets, consumers are prioritizing technologies that enhance comfort, convenience, and sustainability within their living spaces. The residential segment not only leads in volume but also offers high margins, particularly in premium product categories.In the commercial space, such as offices, retail stores, and hospitality venues, demand is being driven by the desire for energy-efficient lighting systems, automated environmental controls, and enhanced aesthetics. Businesses increasingly view lighting and electrical systems as integral to productivity, branding, and energy management, thus fueling investments in advanced switch and dimmer systems.The industrial sector, while representing a smaller portion of the market, holds strategic importance. Here, switches and receptacles must meet high durability and safety standards, particularly in manufacturing, logistics, and infrastructure projects. Automation trends in these sectors further drive the need for intelligent electrical solutions that support operational efficiency and monitoring.End-User AnalysisHomeowners form the most influential end-user segment, driving trends in design, functionality, and innovation. Consumers today are not only concerned with utility but also with the aesthetic integration of switches and dimmers into their home décor. The increasing preference for modular designs and customizable finishes reflects this trend. Homeowners are also early adopters of smart technologies, further encouraging market growth.Businesses, including property developers, commercial facility managers, and retail operators, are investing in technologies that optimize electrical system performance, reduce energy costs, and align with sustainability goals. Their purchasing decisions are increasingly influenced by long-term efficiency and the ability to scale smart building systems.Contractors and electricians also play a critical role in shaping market dynamics. As key influencers during the product selection phase in construction and renovation projects, their preference for reliable, easy-to-install, and code-compliant solutions strongly affects demand trends. Manufacturers that cater to this group with efficient installation systems and responsive customer service stand to gain a competitive edge.Browse full Report - https://exactitudeconsultancy.com/reports/65306/global-switches-dimmers-receptacles-market Market DynamicsGrowth DriversSeveral underlying forces are propelling the market forward. Chief among them is the widespread adoption of smart technologies. As IoT ecosystems expand, the need for interoperable electrical components such as switches, dimmers, and receptacles becomes more pronounced. These devices enable remote control, voice command functionality, and intelligent automation, aligning with consumer expectations for connected living environments.Another major driver is the global focus on energy efficiency. As governments around the world enact stricter energy codes and provide incentives for energy-efficient building systems, the demand for energy-saving solutions such as dimmers and automated switches grows. These products help reduce electricity usage by optimizing lighting levels and eliminating unnecessary power consumption.Additionally, urbanization and rising construction activity, particularly in developing regions, are stimulating demand for modern electrical systems. With increased infrastructure investments, new residential and commercial spaces require sophisticated, scalable, and future-ready wiring and lighting systems.Challenges and RestraintsDespite strong growth prospects, the market faces several notable hurdles. Rapid technological evolution can be a double-edged sword—while it fuels innovation, it also places constant pressure on manufacturers to update their product lines. Companies that fail to keep pace risk becoming obsolete.Supply chain disruptions remain a critical concern. Ongoing global challenges such as material shortages, geopolitical conflicts, and logistical bottlenecks can hamper production timelines and inflate costs. These challenges may translate into pricing volatility and affect the availability of components for projects.Moreover, regulatory complexity is another persistent obstacle. Navigating a diverse landscape of building codes, safety certifications, and energy standards can be daunting, especially for global manufacturers. ...Full story available on Benzinga.com",
    "link": "https://www.benzinga.com/pressreleases/25/06/g46027398/switches-dimmers-and-receptacles-market-reaching-a-valuation-of-around-28-billion-by-2034-exactitu",
    "source": "benzinga",
    "status": "new"
  },
  {
    "id": "6c6471fa-33b5-4650-9268-7e14cd2d1f6e",
    "title": "Software-Defined Vehicle (SDV) Market is expected to reach around $130 billion | Exactitude Consultancy",
    "date": "2025-06-20 14:16:00",
    "body": "Software-Defined Vehicle (SDV) Market Overview 2025-2034 Software-Defined Vehicle (SDV) Market Overview 2025-2034",
    "link": "https://www.globenewswire.com/news-release/2025/06/20/3102792/0/en/Software-Defined-Vehicle-SDV-Market-is-expected-to-reach-around-130-billion-Exactitude-Consultancy.html",
    "source": "globenewswire",
    "status": "new"
  },
  {
    "id": "37127254-7a75-4c48-abf8-9a9fd10cd13a",
    "title": "Software-Defined Vehicle (SDV) Market is expected to reach around $130 billion | Exactitude Consultancy",
    "date": "2025-06-20 14:16:00",
    "body": "Luton, Bedfordshire, United Kingdom, June 20, 2025 (GLOBE NEWSWIRE) -- In 2024, the global Software-Defined Vehicle (SDV) market stands at a valuation of approximately $50 billion, propelled by the rapid evolution of connected vehicle technologies and the increasing deployment of autonomous driving systems. As consumers demand smarter, safer, and more sustainable vehicles, the industry is undergoing a digital transformation that reshapes how vehicles are designed, developed, and operated.Download PDF Brochure: https://exactitudeconsultancy.com/request-sample/66886 By 2034, the market is expected to reach around $130 billion, growing at a Compound Annual Growth Rate (CAGR) of 10.4% over the forecast period. This trajectory is largely attributed to ongoing innovations in software and electronics that allow vehicles to adapt and improve over time, providing users with updated functionalities and safety enhancements via over-the-air (OTA) software updates.Market Drivers: Connectivity, Electrification, and OTA InnovationThe growing demand for real-time vehicle connectivity and customizable user experiences is significantly accelerating the development of SDVs. Today's drivers expect vehicles to behave more like smartphones—offering seamless software updates, interactive infotainment systems, and personalized settings. This shift is pushing manufacturers to invest heavily in software architecture capable of supporting these demands.Moreover, the rapid rise of electric vehicles (EVs) is a key driver of this transition. EVs rely more on software for battery management, energy efficiency, and intelligent navigation systems. Governments worldwide are also supporting this transition with sustainability initiatives and emission reduction regulations, further reinforcing the need for software-centric automotive designs.The ability to deliver OTA updates stands out as a transformative trend. These updates allow manufacturers to improve vehicle functionality post-sale, providing bug fixes, performance enhancements, and even new features without requiring physical visits to service centers. This capability not only improves customer satisfaction but also opens new revenue streams through subscription-based models for additional services.Challenges: Cybersecurity and Technological InvestmentWhile the SDV market is poised for exponential growth, it is not without its challenges. One of the most pressing concerns is cybersecurity. As vehicles become increasingly connected, they also become more vulnerable to cyberattacks. Ensuring secure communication between vehicle systems, infrastructure, and users is paramount to building trust and maintaining safety standards. Implementing end-to-end encryption and intrusion detection systems adds complexity and cost to vehicle design.In addition to security risks, regulatory fragmentation across different regions presents a major hurdle. Varying data privacy laws, compliance requirements, and certification processes can slow down product deployment and limit scalability. This makes international expansion more complicated, particularly for smaller players in the market.The SDV market also requires continuous technological investment, especially in artificial intelligence (AI), machine learning, and data analytics. For OEMs and Tier 1 suppliers, keeping up with these advancements can strain resources, particularly as the competition intensifies. The ongoing semiconductor shortage has further highlighted the industry's dependence on a resilient supply chain, making component availability a critical risk factor.Component Analysis: Hardware, Software, and ServicesThe SDV ecosystem is composed of three core segments: hardware, software, and services. Among these, hardware still dominates due to its foundational role in enabling connectivity, data collection, and real-time processing. Key components include sensors, microcontrollers, onboard computers, and communication modules. These form the physical infrastructure necessary for software-defined functionality.The software segment, however, is rapidly gaining ground. Software enables everything from vehicle diagnostics and OTA updates to infotainment systems and safety algorithms. It is the linchpin that transforms traditional vehicles into intelligent, adaptable platforms. This segment's importance will only increase as more vehicles shift toward autonomous operation and feature-rich driving experiences.Services—such as software maintenance, security updates, cloud storage, and analytics—are emerging as high-value components of the SDV model. The increasing complexity of in-vehicle systems demands continuous support, and service providers are capitalizing on this need by offering long-term contracts and scalable service packages.Vehicle Type and Application BreakdownFrom a vehicle type perspective, passenger cars currently dominate the market due to their sheer volume and quicker adoption of new features. Consumers are actively seeking models equipped with advanced infotainment systems, ADAS (Advanced Driver Assistance Systems), and connectivity features.Meanwhile, commercial vehicles—such as trucks, delivery vans, and fleet-operated vehicles—are seeing rapid SDV adoption. These vehicles benefit immensely from fleet management software that optimizes routes, monitors fuel efficiency, and tracks maintenance schedules, reducing operational costs.Electric vehicles (EVs) and autonomous vehicles represent the future of the SDV landscape. EVs are increasingly designed with software-first architectures, while autonomous vehicles require real-time data processing, sensor fusion, and machine learning algorithms—all made possible through software-defined infrastructures.Key applications within this space include:Vehicle-to-Everything (V2X) communication, enabling interaction between vehicles, infrastructure, and pedestrians to improve safety and traffic efficiency.In-vehicle infotainment systems, enhancing user experience with media streaming, navigation, and app integration.ADAS, which use AI to offer features like automatic braking, lane-keeping assistance, and collision avoidance.Fleet management solutions, optimizing logistics for businesses through centralized control and analytics.Technological Foundations: Cloud, Edge, and AISoftware-defined vehicles rely on a mix of cloud computing, edge computing, and AI/ML (Artificial Intelligence/Machine Learning) to function effectively. Cloud platforms enable real-time data analysis, remote diagnostics, and OTA updates, forming the backbone of connected services. Edge computing, on the other hand, supports ultra-low latency requirements for real-time decision-making, especially in ADAS and autonomous applications.AI and machine learning are critical for enabling intelligent behavior in vehicles. Whether it's predicting maintenance needs, analyzing driver habits, or making split-second decisions in autonomous navigation, AI plays an indispensable role. Another foundational technology is Machine-to-Machine (M2M) communication, which ensures seamless data exchange between connected systems inside and outside the vehicle.Browse full Report - https://exactitudeconsultancy.com/reports/66886/software-defined-vehicle-infrastructure-market Market SegmentationSegmentation by Component:HardwareSoftwareServicesSegmentation by ...Full story available on Benzinga.com",
    "link": "https://www.benzinga.com/pressreleases/25/06/g46027316/software-defined-vehicle-sdv-market-is-expected-to-reach-around-130-billion-exactitude-consultancy",
    "source": "benzinga",
    "status": "new"
  },
  {
    "id": "1",
    "title": "Major Aviation Breakthrough Announced by Stark Industries",
    "date": "2024-07-29T10:00:00Z",
    "body": "Title: Stark Industries Unveils Game-Changing Air Travel Technology\n\nStark Industries has introduced a cutting-edge propulsion system set to transform air travel by increasing speed and energy efficiency. CEO Pepper Potts announced this breakthrough at the International Aviation Expo, signaling a new era in aviation innovation.",
    "link": "https://www.starkindustries.com/news/major-aviation-breakthrough",
    "source": "Institutional Reader",
    "status": "posted"
  },
  {
    "id": "2",
    "title": "New Regulations for Commercial Drone Operations",
    "date": "2024-07-28T15:30:00Z",
    "body": "**Title: New Rules for Commercial Drone Use Announced**\n\nThe Federal Aviation Administration (FAA) has introduced new guidelines to enhance safety and privacy for commercial drone operations. These rules are set to be implemented within the next 30 days.",
    "link": "https://www.faa.gov/news/press_releases/news_story.cfm?newsId=2345",
    "source": "Aviation Pages Reader",
    "status": "posted"
  },
  {
    "id": "3",
    "title": "Global Tech Summit Focuses on AI in Journalism",
    "date": "2024-07-28T11:00:00Z",
    "body": "**Title: Global Tech Summit Explores AI's Role in Journalism**\n\nAt this year's Global Tech Summit, experts gathered to explore how Artificial Intelligence is transforming journalism. Highlights included discussions on automated fact-checking and AI's potential to generate news content.",
    "link": "https://www.newsdata.io/blog/global-tech-summit-2024",
    "source": "Newsdata.io Agent",
    "status": "posted"
  }
]